[{"en":"These technicians typically study ways to increase the productivity of crops and animals. They may keep detailed records, collect samples for analyses, ensure that samples meet proper safety and quality standards, and test crops and animals for disease or to confirm the results of scientific experiments.","id":"ckc.US.base-1.01-1","soc":"19-4011.01","name":"Agricultural Technician"},{"en":"Grounds maintenance workers ensure that the grounds of houses, businesses, and parks are attractive, orderly, and healthy in order to provide a pleasant outdoor environment. Some jobs are seasonal, available mainly in the spring, summer, and fall. Most of this highly physical work is done outdoors in all weather conditions.","id":"ckc.US.base-1.01-10","soc":"37-3011.00","name":"Landscaping or Groundskeeping Worker"},{"en":"Animal breeders use their knowledge of genetics and animal science to select and breed animals that will produce offspring with desired traits and characteristics. For example, they breed chickens that lay more eggs, pigs that produce leaner meat, and sheep with more desirable wool. Others breed and raise cats, dogs, and other household pets.","id":"ckc.US.base-1.01-2","soc":"45-2021.00","name":"Animal Breeder"},{"en":"Animal caretakers typically work with cats and dogs in animal shelters or rescue leagues. They take care of animals' basic needs and may have administrative duties like keeping records, answering questions from the public, educating visitors about pet health, and screening people who want to adopt an animal. Experienced caretakers may have more responsibilities, such as helping vaccinate or euthanize animals alongside a veterinarian.","id":"ckc.US.base-1.01-3","soc":"39-2021.00","name":"Animal Caretaker"},{"en":"Farmers and ranchers own and operate mainly family-owned farms. They also may rent (lease) land and operate it as a working farm. Those operating small farms or ranges may do everything, including harvesting and inspecting the land, growing crops, and raising animals. By contrast, those operating larger farms generally have employees to help with physical work.  All farmers and ranchers track technological improvements in animal breeding and seeds, choosing new products that might increase output.","id":"ckc.US.base-1.01-4","soc":"11-9013.00","name":"Farmer or Rancher"},{"en":"Farm and ranch animal workers care for live animals, including cattle, sheep, pigs, goats, horses, poultry, finfish, shellfish, and bees. These animals usually are raised to supply meat, fur, skins, feathers, eggs, milk, or honey.  Crop and nursery farmworkers help grow and harvest grains, fruits, vegetables, nuts, and other crops. They plant, seed, prune, irrigate, and harvest crops, and pack and load them for shipment.","id":"ckc.US.base-1.01-5","soc":"45-2092.00","name":"Farmworker"},{"en":"Fishers catch and trap various types of animal life, working in deep or shallow water. In deep water, they typically work on large fishing boats equipped for long stays at sea. Others work in shallow water on small boats that often have a crew of only one or two. They might put nets across the mouths of rivers or inlets; use pots and traps to catch fish or shellfish like lobsters and crabs; or use dredges to gather other shellfish like oysters and scallops.","id":"ckc.US.base-1.01-6","soc":"45-3011.00","name":"Fisher"},{"en":"Technicians working in manufacturing investigate new production or processing techniques. They also ensure products will be fit for distribution or efficiently produced. Many spend time inspecting foodstuffs, chemicals, and additives to determine whether they are safe and have the proper combination of ingredients.","id":"ckc.US.base-1.01-7","soc":"19-4011.02","name":"Food Science Technician"},{"en":"Forest and conservation workers measure and improve the quality of forests. Under the supervision of foresters and forest and conservation technicians, they develop, maintain, and protect forests. Some work on tree farms or orchards where they plant, cultivate, and harvest many different kinds of trees. Others work in forest nurseries, where they sort through tree seedlings, discarding ones that do not meet standards.","id":"ckc.US.base-1.01-8","soc":"45-4011.00","name":"Forest or Conservation Worker"},{"en":"Foresters have a wide range of duties, and their responsibilities vary by employer. Some draw up plans to regenerate forested lands, monitor the progress of those lands, and supervise tree harvests. Some devise plans to keep forests free from disease, harmful insects, and damaging wildfires. Many supervise forest and conservation workers and technicians, directing their work and evaluating their progress.","id":"ckc.US.base-1.01-9","soc":"19-1032.00","name":"Forester"},{"en":"Bailiffs, also known as marshals or court officers, have different duties depending on the court, including enforcing courtroom rules, assisting judges, guarding juries, delivering court documents, and providing general security for courthouses.","id":"ckc.US.base-1.02-1","soc":"33-3011.00","name":"Bailiff"},{"en":"Security guards or security officers protect property, enforce rules on the property, and deter criminal activity. Some are assigned a stationary position from which they monitor alarms or surveillance cameras. Others are assigned a patrol area where they conduct security checks.","id":"ckc.US.base-1.02-10","soc":"33-9032.00","name":"Security Guard"},{"en":"Inside a prison or jail, correctional officers enforce rules and regulations. They maintain security by preventing disturbances, assaults, and escapes, and by inspecting facilities. They check cells and other areas for unsanitary conditions, contraband, signs of a security breach (such as tampering with window bars and doors), and other rule violations. Officers also escort prisoners to courtrooms, medical facilities, and other destinations.","id":"ckc.US.base-1.02-2","soc":"33-3012.00","name":"Correctional Officer or Jailer"},{"en":"Detectives and criminal investigators are uniformed or plainclothes investigators who gather facts and collect evidence for criminal cases. They conduct interviews, examine records, observe the activities of suspects, and participate in raids and arrests. They usually specialize in investigating one type of crime, such as homicide or fraud.","id":"ckc.US.base-1.02-3","soc":"33-3021.00","name":"Detective or Criminal Investigator"},{"en":"An EMT, also known as an EMT-Basic, cares for patients at the scene of an incident while taking patients by ambulance to a hospital. They assess a patient’s condition and manage respiratory, cardiac, and trauma emergencies. An Advanced EMT, also known as an EMT-Intermediate, has completed the requirements for the EMT level plus instruction in more advanced medical procedures, such as administering intravenous (IV) fluids and some medications.","id":"ckc.US.base-1.02-4","soc":"29-2041.00","name":"Emergency Medical Technician"},{"en":"Fire inspectors examine buildings for fire hazards and ensure that federal, state, and local fire codes are met. Fire investigators determine the origin and cause of fires and explosions. Forest fire inspectors and prevention specialists assess outdoor fire hazards in public and residential areas.","id":"ckc.US.base-1.02-5","soc":"33-2021.00","name":"Fire Inspector or Investigator"},{"en":"When responding to an emergency, firefighters are responsible for connecting hoses to hydrants, operating the pumps that power the hoses, climbing ladders, and using other tools to break through debris. Firefighters also enter burning buildings to extinguish fires and rescue people. Many are responsible for providing medical attention. Two out of three calls to firefighters are for medical emergencies, not fires.","id":"ckc.US.base-1.02-6","soc":"33-2011.00","name":"Firefighter"},{"en":"Fish and game wardens enforce fishing, hunting, and boating laws. They patrol fishing and hunting areas, conduct search and rescue operations, investigate complaints and accidents, and educate the public about laws regulating and protecting animal and aquatic life.","id":"ckc.US.base-1.02-7","soc":"33-3031.00","name":"Fish and Game Warden"},{"en":"Police and sheriff’s patrol officers are the most common type of police officer, and have general law enforcement duties. They wear uniforms that allow the public to easily recognize them as police officers. They have regular patrols and respond to emergency and nonemergency calls. During patrols, they look for signs of criminal activity and may conduct searches and arrest suspected criminals.","id":"ckc.US.base-1.02-8","soc":"33-3051.00","name":"Police Officer or Sheriff"},{"en":"Private detectives and investigators search for information about legal, financial, and personal matters. They offer many services, including verifying people’s backgrounds and statements, finding missing persons, and investigating computer crimes.","id":"ckc.US.base-1.02-9","soc":"33-9021.00","name":"Private Detective or Investigator"},{"en":"Architectural drafters draw architectural and structural features of buildings for construction projects. They may specialize in a type of building, such as residential or commercial. They may also specialize by the materials used, such as steel, wood, or reinforced concrete. Civil drafters prepare topographical maps used in construction and civil engineering projects, such as highways, bridges, and flood-control projects.","id":"ckc.US.base-1.03-1","soc":"17-3011.00","name":"Architectural or Civil Drafter"},{"en":"Forest or conservation technicians train and supervise workers in forest management, range management, natural resource protection and fire prevention. They often compile data relating to forest and range management. They assist foresters and conservation scientists to improve and protect natural resources.","id":"ckc.US.base-1.03-10","soc":"19-4093.00","name":"Forest or Conservation Technician"},{"en":"These technicians assist industrial engineers in devising efficient systems that integrate workers, machines, materials, information, and energy to make a product or provide a service. They prepare machinery and equipment layouts, plan workflows, conduct statistical production studies, and analyze production costs.","id":"ckc.US.base-1.03-11","soc":"17-3026.00","name":"Industrial Engineering Technician"},{"en":"These engineers develop, process, and test materials used to create a wide range of products, from computer chips and aircraft wings to golf clubs and biomedical devices. They study the properties and structures of metals, ceramics, plastics, composites, nanomaterials (extremely small substances), and other substances in order to create new materials that meet certain mechanical, electrical, and chemical requirements.","id":"ckc.US.base-1.03-12","soc":"17-2131.00","name":"Materials Engineer"},{"en":"These engineers research, design, develop, build, and test mechanical and thermal sensors and devices, including tools, engines, and machines. They are often responsible for the integration of sensors, controllers, and machinery. Computers help them create and analyze designs, run simulations and test how a machine is likely to work, interact with connected systems, and generate specifications for parts.","id":"ckc.US.base-1.03-13","soc":"17-2141.00","name":"Mechanical Engineer"},{"en":"These technicians help mechanical engineers design, develop, test, and manufacture mechanical devices, including tools, engines, and machines. They may make sketches and rough layouts, record and analyze data, make calculations and estimates, and report their findings.","id":"ckc.US.base-1.03-14","soc":"17-3027.00","name":"Mechanical Engineering Technician"},{"en":"These engineers search for mineral deposits and evaluate possible sites. Once a site is identified, they plan how to extract the metals or minerals efficiently and in environmentally sound ways. They often specialize in one particular mineral or metal, such as coal or gold. They typically design and develop mines and figure out the best, most efficient way to extract metal or minerals.","id":"ckc.US.base-1.03-15","soc":"17-2151.00","name":"Mining or Geological Engineer"},{"en":"These technicians typically work in nuclear energy production or assist physicists, engineers, and other professionals in nuclear research. They operate special equipment used in these activities and monitor levels of radiation. Most work in nuclear power plants where they ensure safe and efficient operation of reactors and other equipment.","id":"ckc.US.base-1.03-16","soc":"19-4051.00","name":"Nuclear Technician"},{"en":"These technologists perform patient diagnostic imaging examinations, like x-rays. Some prepare a mixture for the patient to drink that allows soft tissue to be viewed on images the radiologist reviews.  MRI technologists operate magnetic resonance imaging (MRI) scanners to create diagnostic images. They inject patients with contrast dyes so images will show up on the scanner. The scanners use magnetic fields in combination with the contrast agent to produce images that a physician can use to diagnose medical problems.","id":"ckc.US.base-1.03-17","soc":"29-2034.00","name":"Radiologic Technologist or Technician"},{"en":"These technicians, also known as audio engineers or sound mixers, operate computers and equipment that record, synchronize, mix, or reproduce music, voices, or sound effects in recording studios, sporting arenas, theater productions, or movie and video productions. They record audio performances or events and may combine audio tracks that were recorded separately to create a multilayered final product.","id":"ckc.US.base-1.03-18","soc":"27-4014.00","name":"Sound Engineering Technician"},{"en":"These technicians collect data and make maps of the Earth’s surface. Surveying technicians visit sites to take measurements of the land. Mapping technicians use geographic data to create maps. They both assist surveyors, cartographers and photogrammetrists.","id":"ckc.US.base-1.03-19","soc":"17-3031.00","name":"Surveying or Mapping Technician"},{"en":"These technicians set up and operate audio and video equipment. They also connect wires and cables and set up and operate sound and mixing boards and related electronic equipment. They work with microphones, speakers, video screens, projectors, video monitors, and recording equipment that are all used for meetings, concerts, sports events, conventions, and news conferences.","id":"ckc.US.base-1.03-2","soc":"27-4011.00","name":"Audio & Video Equipment Technician"},{"en":"Surveyors make precise measurements to determine property boundaries. They provide data relevant to the shape and contour of the Earth’s surface for engineering, mapmaking, and construction projects. When taking field measurements, they use handheld Global Positioning System (GPS) units and automated systems known as robotic total stations to collect relevant information about the terrain. They then interpret and verify the results on a computer.","id":"ckc.US.base-1.03-20","soc":"17-1022.00","name":"Surveyor"},{"en":"These technicians, also known as windtechs, install, maintain, and repair wind turbines. Wind turbines are large mechanical devices that convert wind energy into electricity. The turbine is made up of three major components: a tower, three blades, and a nacelle, which is composed of an outer case, generator, gearbox, and brakes. Technicians install and repair the components of these structures.","id":"ckc.US.base-1.03-21","soc":"49-9081.00","name":"Wind Turbine Technician"},{"en":"These broadcast engineers set up, operate, and maintain equipment that regulates the signal strength, clarity, and ranges of sounds and colors for radio or television broadcasts. They operate transmitters, either in studios or on location in the field, to broadcast radio or television programs. They also use computer programs to edit audio and video recordings.","id":"ckc.US.base-1.03-3","soc":"27-4012.00","name":"Broadcast Technician"},{"en":"Cartographers are mapmakers who design user-friendly maps. Photogrammetrists are specialized mapmakers who use various technologies to build models of the Earth’s surface and its features for the purpose of creating maps. Both use geodetic surveys (land surveys that account for the curvature of the Earth’s surface) and remote-sensing systems, including aerial cameras and satellites.","id":"ckc.US.base-1.03-4","soc":"17-1021.00","name":"Cartographer or Photogrammetrist"},{"en":"These technicians help civil engineers to plan, design, and build highways, bridges, utilities, and other infrastructure projects. They also help to plan, design, and build commercial, industrial, residential, and land development projects. Sometimes they estimate construction costs and develop specifications. Other times, they prepare drawings or survey land. They also may set up and monitor various instruments for traffic studies.","id":"ckc.US.base-1.03-5","soc":"17-3022.00","name":"Civil Engineering Technician"},{"en":"These inspectors examine buildings, highways and streets, sewer and water systems, dams, bridges, and other structures. They also inspect electrical; heating, ventilation, air-conditioning, and refrigeration (HVACR); and plumbing systems.","id":"ckc.US.base-1.03-6","soc":"47-4011.00","name":"Construction or Building Inspector"},{"en":"These technicians help engineers design and develop computers, communications equipment, medical monitoring devices, navigational equipment, and other electrical and electronic equipment. They often work in product evaluation and testing, and use measuring and diagnostic devices to adjust, test, and repair equipment. They are also involved in the manufacture and deployment of equipment for automation.","id":"ckc.US.base-1.03-7","soc":"17-3023.00","name":"Electrical & Electronic Engineering Technician"},{"en":"These technicians combine knowledge of mechanical technology with knowledge of electrical and electronic circuits. They operate, test, and maintain unmanned, automated, robotic, or electromechanical equipment.","id":"ckc.US.base-1.03-8","soc":"17-3024.00","name":"Electro-Mechanical Technician"},{"en":"These technicians carry out the plans that environmental engineers develop. They test, operate, and, if necessary, modify equipment used to prevent or clean up environmental pollution. They may collect samples for testing, or they may work to mitigate sources of environmental pollution.","id":"ckc.US.base-1.03-9","soc":"17-3025.00","name":"Environmental Engineering Technician"},{"en":"Pilots plan flights by checking that the aircraft is operable and safe, that the cargo has been loaded correctly, and that weather conditions are acceptable. They file flight plans with air traffic control and may modify the plans in flight due to changing weather conditions or other factors. Some are also instructors using simulators and dual-controlled aircraft to teach students how to fly.","id":"ckc.US.base-1.04-1","soc":"53-2011.00","name":"Aircraft Pilot"},{"en":"These drivers transport goods from one location to another. Most are long-haul drivers and operate trucks with a gross vehicle weight (GVW) capacity of more than 26,000 pounds. These drivers deliver goods over intercity routes, sometimes spanning several states.","id":"ckc.US.base-1.04-10","soc":"53-3032.00","name":"Truck Driver"},{"en":"These drivers transport people between places—including work, school, and shopping centers—and across state and national borders. Some drive regular routes, and others transport passengers on chartered trips or sightseeing tours. They drive a range of vehicles, from 15-passenger buses to 60-foot articulated buses (with two connected sections) that can carry more than 100 passengers.","id":"ckc.US.base-1.04-2","soc":"53-3021.00","name":"Bus Driver"},{"en":"These engineers drive freight or passenger trains between stations. They drive long-distance trains and commuter trains, but not subway trains. Most drive diesel-electric engines, although some drive locomotives powered by battery or electricity. They must be aware of the goods their train is carrying because different types of freight require different types of driving, based on the conditions of the rails.","id":"ckc.US.base-1.04-3","soc":"53-4011.00","name":"Locomotive Engineer"},{"en":"Conductors travel on both freight and passenger trains. They coordinate activities of the train crew. On passenger trains, they ensure safety and comfort and make announcements. On freight trains they are responsible for overseeing cargo loading and unloading. Yardmasters do similar work, except they do not travel on trains. They oversee and coordinate the activities of workers in the rail yard.","id":"ckc.US.base-1.04-4","soc":"53-4031.00","name":"Railroad Conductors and Yardmasters"},{"en":"Refuse and recyclable material collectors gather garbage and recyclables from homes and businesses to transport to a dump, landfill, or recycling center. Many collectors lift garbage cans by hand and empty them into their truck. Some collectors drive the garbage or recycling truck along a scheduled route and may use a hydraulic lift to empty the contents of a dumpster into the truck.","id":"ckc.US.base-1.04-5","soc":"53-7081.00","name":"Refuse and Recyclable Material Collector"},{"en":"Sailors, or deckhands, operate and maintain the vessel and deck equipment. They make up the deck crew and keep all parts of a ship, other than areas related to the engine and motor, in good working order. New deckhands are called ordinary seamen and do the least complicated tasks. Experienced deckhands are called able seamen and usually make up most of a crew.","id":"ckc.US.base-1.04-6","soc":"53-5011.00","name":"Sailor or Marine Oiler"},{"en":"Captains, sometimes called masters, have overall command of a vessel. They have the final responsibility for the safety of the crew, cargo, and passengers. They steer and operate vessels, direct crew members, ensure that proper safety procedures are followed, purchase equipment and supplies and arrange for any necessary maintenance and repair.","id":"ckc.US.base-1.04-7","soc":"53-5021.01","name":"Ship Captain"},{"en":"Stock clerks and order fillers receive, unpack, and track merchandise. They move products from a warehouse to store shelves, keeping a record of items that enter or leave the stockroom and inspect for damaged goods. These clerks also use handheld RFID scanners to keep track of merchandise. Order fillers retrieve customer orders and prepare them to be shipped.","id":"ckc.US.base-1.04-8","soc":"43-5081.03","name":"Stock Clerk‚ Warehouse or Storage Yard"},{"en":"Taxi drivers, ride-hailing drivers, and chauffeurs drive people to and from the places they need to go, like homes, workplaces, airports, and shopping centers. They must be familiar with city streets and locations to take passengers to their destinations.","id":"ckc.US.base-1.04-9","soc":"53-3041.00","name":"Taxi Driver or Chauffeur"},{"en":"Often called bricklayers, these masons build and repair walls, floors, partitions, fireplaces, chimneys, and other structures with brick, terra cotta, precast masonry panels, concrete block, and other masonry materials. Pointing, cleaning, and caulking skills are required to  repair brickwork, particularly on older structures from which mortar has come loose.","id":"ckc.US.base-1.05-1","soc":"47-2021.00","name":"Brickmason or Blockmason"},{"en":"Floor, ceiling, and wall insulators install insulation in attics, under floors, and behind walls in homes and other buildings. Most unroll, cut, fit, and staple batts of fiberglass insulation between wall studs and ceiling joists. Some workers spray foam insulation with a compressor hose into the space being filled. Mechanical insulators apply insulation to equipment, pipes, or ductwork in businesses, factories, and many other types of buildings.","id":"ckc.US.base-1.05-10","soc":"47-2131.00","name":"Insulation Worker"},{"en":"Painters apply paint, stain, and coatings to walls and ceilings, buildings, bridges, and other structures. There are several ways to apply paint to a surface, and painters must choose the correct tool for each job, such as a roller, power sprayer, or brush.","id":"ckc.US.base-1.05-11","soc":"47-2141.00","name":"Painter, Construction or Maintenance"},{"en":"Plumbers, pipefitters, and steamfitters install and repair pipes that carry liquids or gases to, from, and within businesses, homes, and factories. They determine the necessary materials for a job, connect pipes, and perform pressure tests.","id":"ckc.US.base-1.05-12","soc":"47-2152.00","name":"Plumber, Pipefitter, or Steamfitter"},{"en":"Roofers replace, repair, and install the roofs of buildings, using a variety of materials, including shingles, bitumen, and metal. They inspect problem roofs to determine the best way to repair them, measure them to calculate the quantities of materials needed, and replace damaged or rotting joists or plywood.","id":"ckc.US.base-1.05-13","soc":"47-2181.00","name":"Roofer"},{"en":"Solar photovoltaic (PV) installers, also known as PV installers, assemble, install, and maintain solar panel systems on rooftops or other structures. Many start out performing basic tasks, such as installing support structures and placing PV panels or PV shingles on top of them. Once panels are in place, more-experienced installers usually perform more-complex duties, such as connecting electrical components.","id":"ckc.US.base-1.05-14","soc":"47-2231.00","name":"Solar Photovoltaic Installer"},{"en":"Ironworkers install structural and reinforcing iron and steel to form and support buildings, bridges, and roads. When building tall structures such as skyscrapers, they erect steel frames and assemble the cranes and derricks that move materials and equipment around the construction site.","id":"ckc.US.base-1.05-15","soc":"47-2221.00","name":"Structural Iron & Steel Worker"},{"en":"Carpenters are a versatile occupation in the construction industry, with workers usually doing many different tasks. For example, some carpenters insulate office buildings and others install drywall or kitchen cabinets in homes. Rough carpenters help construct tall buildings or bridges by installing wooden concrete forms for cement footings or pillars.","id":"ckc.US.base-1.05-2","soc":"47-2031.00","name":"Carpenter"},{"en":"These workers place and finish concrete. They may color concrete surfaces, expose aggregate (small stones) in walls and sidewalks, or make concrete beams, columns, and panels. Throughout the process of pouring, leveling, and finishing concrete, masons monitor how the wind, heat, or cold affects the curing of the concrete.","id":"ckc.US.base-1.05-3","soc":"47-2051.00","name":"Cement Mason"},{"en":"Construction craft laborers perform a wide variety of construction-related activities during all phases of construction. Many spend their time preparing and cleaning up construction sites, using tools such as shovels and brooms. Others, such as those on road crews, may specialize and learn to control traffic patterns and operate pavement breakers, jackhammers, earth tampers, or surveying equipment.","id":"ckc.US.base-1.05-4","soc":"47-2061.00","name":"Construction Laborer"},{"en":"Drywallers or hangers cut and hang the panels of wallboard. Ceiling tile installers hang ceiling tiles and create suspended ceilings. Tiles may be applied directly to the ceiling, attached to furring strips, or suspended on runners that are connected by wire to the ceiling. Sometimes they are called acoustical carpenters because they also install tiles that block sound.","id":"ckc.US.base-1.05-5","soc":"47-2081.00","name":"Drywall and Ceiling Tile Installer"},{"en":"Floor layers, except carpet, wood, and hard tiles, install a wide variety of resilient flooring materials like linoleum, laminate, manufactured wood, and wood tile. Linoleum installers lay this hard, washable floor material, cutting it to size and gluing it into place. Vinyl installers install plastic-based flooring that includes vinyl ester, vinyl sheeting, and vinyl tile.","id":"ckc.US.base-1.05-6","soc":"47-2042.00","name":"Floor Layer"},{"en":"General maintenance and repair workers fix and maintain machines, mechanical equipment, and buildings. They paint, repair flooring, and work on plumbing, electrical, and air-conditioning and heating systems. They are hired for maintenance and repair tasks not complex enough to need specialized training of a licensed tradesperson, such as a plumber or electrician.","id":"ckc.US.base-1.05-7","soc":"49-9071.00","name":"General Maintenance & Repair Worker"},{"en":"In homes, glaziers install or replace windows, mirrors, shower doors, and bathtub enclosures. They fit glass for tabletops and display cases. On commercial interior projects, they install room dividers and security windows. Glazing projects may also involve exterior work such as replacing storefront windows for supermarkets, auto dealerships, and banks.","id":"ckc.US.base-1.05-8","soc":"47-2121.00","name":"Glazier (glass installer)"},{"en":"These workers identify and dispose of asbestos, lead, radioactive waste, and other hazardous materials (hazmat). They also neutralize and clean up flammable, corrosive, or toxic materials; they are sometimes spilled during natural or human-made disasters and accidents, like those involving trains, trucks, or other vehicles transporting hazardous materials.","id":"ckc.US.base-1.05-9","soc":"47-4041.00","name":"Hazardous Materials Removal Worker"},{"en":"Airframe and Powerplant (A&P) mechanics are certified generalists who can independently perform many aircraft maintenance and alteration tasks. They repair and maintain most parts of an aircraft, including the engines, landing gear, brakes, and air-conditioning system.","id":"ckc.US.base-1.06-1","soc":"49-3011.00","name":"Aircraft Mechanic & Service Technician"},{"en":"These small engine mechanics service and repair outdoor power equipment, such as lawnmowers, edge trimmers, garden tractors, and portable generators. Some may work on snowblowers and snowmobiles, but this work is highly seasonal and regional.","id":"ckc.US.base-1.06-10","soc":"49-3053.00","name":"Outdoor Power Equipment or Other Small Engine Mechanics"},{"en":"Camera operators capture a wide range of material for TV shows, movies, and other media.  Many supervise one or more assistants. The assistants set up the camera equipment and may be responsible for its storage and care. Assistants also help the operator determine the best shooting angle and make sure that the camera stays in focus.","id":"ckc.US.base-1.06-11","soc":"27-4031.00","name":"Television, Video, or Motion Picture Camera Operator"},{"en":"These service technicians or service techs, inspect, maintain, and repair cars and light trucks.  Although they work on traditional mechanical systems like engines, transmissions, and drivebelts, they also work on a growing number of electronic systems. Braking, transmission, and steering systems, for example, are controlled primarily by computers and electronic components.","id":"ckc.US.base-1.06-2","soc":"49-3023.00","name":"Automotive Service Technician & Mechanic"},{"en":"These diesel technicians inspect, repair, or overhaul buses and trucks, or maintain and repair any type of diesel engine. This work is becoming more complex as engines and other components use more electronic systems to control their operation. For example, fuel injection and engine timing systems rely on microprocessors to maximize fuel efficiency and minimize harmful emissions.","id":"ckc.US.base-1.06-3","soc":"49-3031.00","name":"Diesel Mechanic & Engine Service Specialist"},{"en":"These mechanics and service technicians service and repair farm equipment, such as tractors and harvesters. They also work on smaller consumer-grade lawn and garden tractors. Most work for dealer repair shops, where farmers increasingly send their equipment for maintenance.","id":"ckc.US.base-1.06-4","soc":"49-3041.00","name":"Farm Equipment Mechanic"},{"en":"These technicians—work on heating, ventilation, cooling, and refrigeration (HVACR) systems that control the temperature and air quality in buildings. Some specialize in one or more specific aspects of HVACR, such as radiant heating systems, solar panels, testing and balancing, or commercial refrigeration.","id":"ckc.US.base-1.06-5","soc":"49-9021.00","name":"Heating, Air-Conditioning, or Refrigeration Technician"},{"en":"These mechanics, also called maintenance machinists, keep machines in working order by detecting and correcting errors before the machine or the products it produces are damaged. Many machines are increasingly run by computers. Mechanics use technical manuals, their understanding of industrial equipment, and observation to determine the cause of a problem and then fix it.","id":"ckc.US.base-1.06-6","soc":"49-9041.00","name":"Industrial Machinery Mechanic"},{"en":"These repairers, also known as biomedical equipment technicians (BMETs), repair a wide range of electronic, electromechanical, and hydraulic equipment used in hospitals and health practitioners’ offices. They may work on patient monitors, defibrillators, ventilators, anesthesia machines, and other life-supporting equipment. Some work on medical imaging equipment (x rays, CAT scanners, and ultrasound equipment), voice-controlled operating tables, and electric wheelchairs.","id":"ckc.US.base-1.06-7","soc":"31-9093.00","name":"Medical Equipment Repairer"},{"en":"Millwrights install, maintain, and disassemble industrial machines. They perform repairs that include replacing worn or defective parts. They also may take apart the entire machine, a common situation when a manufacturing plant needs to clear floor space for new machinery. In taking apart a machine, they carefully disassemble, categorize, and package each part of it.","id":"ckc.US.base-1.06-8","soc":"49-9044.00","name":"Millwright"},{"en":"These mechanics repair and maintain construction and surface mining equipment, such as bulldozers, cranes, graders, and excavators. Most work for governments, equipment rental and leasing shops, and large construction and mining companies.","id":"ckc.US.base-1.06-9","soc":"49-3042.00","name":"Mobile Heavy Equipment Service Technician"},{"en":"These technicians specialize in repairing and maintaining a plane’s electronic instruments, such as radio communication devices and equipment, radar systems, and navigation aids. As the use of digital technology increases, more time is spent maintaining computer systems. The ability to repair and maintain many avionics and flight instrument systems is granted through the Airframe rating, but other licenses or certifications may be needed as well.","id":"ckc.US.base-1.07-1","soc":"49-2091.00","name":"Avionics Technician"},{"en":"These workers repair, maintain, or install computers, word processing systems, automated teller machines, and electronic office machines, such as duplicating and fax machines.","id":"ckc.US.base-1.07-2","soc":"49-2011.00","name":"Computer and Office Machine Repairer"},{"en":"These transportation workers install, adjust, or maintain mobile communication equipment, including sound, sonar, security, navigation, and surveillance systems on trains, watercraft, or other vehicles.","id":"ckc.US.base-1.07-3","soc":"49-2094.00","name":"Electrical & Electronic Installer or Repairer, Commercial &  Industrial Equipment"},{"en":"These power-line workers install and maintain the power grid—the network of power lines that moves electricity from generating plants to customers. They routinely work with high-voltage electricity, which requires extreme caution. Telecommunications line installers install and maintain the lines and different types of cables used by network communications companies to provide different services, like local and long-distance telephone, cable television, or Internet.","id":"ckc.US.base-1.07-4","soc":"49-9051.00","name":"Electrical Power-Line Installer & Repairer"},{"en":"Electricians install, maintain, and repair electrical power, communications, lighting, and control systems in homes, businesses, and factories. Many work alone, but sometimes they collaborate with others. For example, experienced electricians may work with building engineers and architects to help design electrical systems for new construction.","id":"ckc.US.base-1.07-5","soc":"47-2111.00","name":"Electrician"},{"en":"These installers and repairers, also called elevator constructors or elevator mechanics, assemble, install, maintain, and replace elevators, escalators, chairlifts, moving walkways, and similar equipment in buildings.  They usually specialize in installation, maintenance, or repair work. Maintenance and repair generally requires greater knowledge of electronics, hydraulics, and electricity because a large part of maintenance and repair work is troubleshooting.","id":"ckc.US.base-1.07-6","soc":"47-4021.00","name":"Elevator Installer and Repairer"},{"en":"These installers and repairers, also known as telecom technicians, set up and maintain devices or equipment that carry communications signals, like telephone lines and Internet routers, in offices, private homes, and buildings that are under construction.","id":"ckc.US.base-1.07-7","soc":"49-2022.00","name":"Telecommunications Equipment Installer or Repairer"},{"en":"These repairers can repair most damage from vehicle collisions and make vehicles look and drive like new. Repairs may be minor, such as replacing a cracked windshield, or major, such as replacing an entire door panel. After a major collision, the underlying frame of a car can become weakened or compromised. Body repairers restore the structural integrity of car frames to manufacturer specifications.","id":"ckc.US.base-1.08-1","soc":"49-3021.00","name":"Automotive Body Repairer"},{"en":"These workers fabricate or install products that are made from thin metal sheets. Examples: in fabrication, workers make precision sheet metal parts for a variety of industries, from power generation to medical device manufacturing; in installation, workers install heating, ventilation, and air conditioning (HVAC) ducts.","id":"ckc.US.base-1.08-10","soc":"47-2211.00","name":"Sheet Metal Worker"},{"en":"Tool and die makers construct precision tools or metal forms, called dies, that are used to cut, shape, and form metal and other materials. They produce jigs and fixtures—devices that hold metal while it is bored, stamped, or drilled—and measuring devices like gauges. Dies are used to shape metal in stamping and forging operations; metal molds are made for die casting and for molding plastics, ceramics, and composite materials.","id":"ckc.US.base-1.08-11","soc":"51-4111.00","name":"Tool and Die Maker"},{"en":"Welders, cutters, solderers, and brazers use hand-held or remotely controlled equipment to join or cut metal parts, filling holes, indentations, or seams in metal products. Welders join metal in many industries, from building construction to ship and auto manufacturing. Closely related, cutters cut metal, like dismantling railroad cars, autos, and airplanes. Solderers and brazers use heat to join metal objects together but melting the filler metal at different temperatures.","id":"ckc.US.base-1.08-12","soc":"51-4122.00","name":"Welder, Cutter, Solderer, or Brazer"},{"en":"These workers assemble, install, maintain, and repair boilers, closed vats, and other large vessels or containers that hold liquids and gases. During a boiler installation, they first line up boilerplates and parts, and then use metalworking machinery and other tools to remove irregular edges so that the parts fit together properly.","id":"ckc.US.base-1.08-2","soc":"47-2011.00","name":"Boilermaker"},{"en":"Cabinetmakers and bench carpenters cut, shape, assemble, and make parts for wood products. They often design and create sets of cabinets that are customized for particular spaces. In some cases, their duties begin with designing a set of cabinets to specifications and end with installing the cabinets.","id":"ckc.US.base-1.08-3","soc":"51-7011.00","name":"Cabinetmaker"},{"en":"Operators operate computer-controlled machines or robots to perform functions on metal or plastic workpieces. Programmers develop computer programs to control the machining or processing of metal or plastic parts by automatic machine tools, equipment, or systems.","id":"ckc.US.base-1.08-4","soc":"51-4012.00","name":"Computer Control Programmer or Operator"},{"en":"Bench jewelers, also known as metalsmiths, silversmiths, goldsmiths, and platinumsmiths, are the most common type of jewelers. They possess a wide array of skills, from simple jewelry cleaning and repair to making molds and pieces from scratch. Gemologists analyze, describe, and certify the quality and characteristics of gemstones. They certify items are of a particular quality.","id":"ckc.US.base-1.08-5","soc":"51-9071.00","name":"Jeweler"},{"en":"These workers use machine tools, such as lathes, milling machines, and grinders, to produce precision metal parts. Many must be able to use both manual and computer numerically controlled (CNC) machinery. CNC machines control the cutting tool speed and do all necessary cuts to create a part. The machinist determines the cutting path, the speed of the cut, and the feed rate by programming instructions into the CNC machine.","id":"ckc.US.base-1.08-6","soc":"51-4041.00","name":"Machinist"},{"en":"These technicians construct, fit, and repair medical supportive devices, including hearing aids, foot arch supports, facial parts, and foot and leg braces. Using different types of materials, like metal, plastic, and leather, they create a variety of medical devices for patients who need them because of a birth defect, an accident, disease, amputation, or the effects of aging.","id":"ckc.US.base-1.08-7","soc":"51-9082.00","name":"Medical Appliance Technician"},{"en":"Museum technicians, also known as registrars or collections specialists, concentrate on the care and safeguarding of collection and exhibition objects. Conservators handle, preserve, treat, and keep records of works of art, artifacts, and specimens. They may conduct historical, scientific, and archeological research. They document their findings and treat items to minimize deterioration or restore them to their original state.","id":"ckc.US.base-1.08-8","soc":"25-4013.00","name":"Museum Technician or Conservator"},{"en":"Opticians help fit eyeglasses and contact lenses, following prescriptions from ophthalmologists and optometrists. They also help customers decide which eyeglass frames or contact lenses to buy. Those working in small shops or preparing custom orders may cut lenses and insert them into frames—tasks usually performed by ophthalmic laboratory technicians.","id":"ckc.US.base-1.08-9","soc":"29-2081.00","name":"Optician, Dispensing"},{"en":"Retail bakers work primarily in grocery stores and specialty shops like bakeries, producing smaller quantities of baked goods for people to eat in the shop or for sale as specialty baked goods. Commercial bakers, also called production bakers, work in manufacturing facilities that produce breads, pastries, and other baked products. They use high-volume mixing machines and ovens to mass-produce standardized baked goods.","id":"ckc.US.base-1.09-1","soc":"51-3011.00","name":"Baker"},{"en":"Butchers cut and trim meat from larger, wholesale portions into steaks, chops, roasts, and other cuts. Then they prepare meat for sale by performing various duties, such as weighing meat, wrapping it, and putting it out for display. In retail stores, they also wait on customers and prepare special cuts of meat upon request. Butchers in meat-processing plants are also known as meatcutters.","id":"ckc.US.base-1.09-2","soc":"51-3021.00","name":"Butcher or Meat Cutter"},{"en":"Fast-food cooks prepare a limited selection of menu items in fast-food restaurants. They cook and package food, such as hamburgers and fried chicken, to be kept warm until served.","id":"ckc.US.base-1.09-3","soc":"35-2011.00","name":"Cook, Fast Food"},{"en":"Institution and cafeteria cooks work in the kitchens of schools, cafeterias, businesses, hospitals, and other institutions. Although they typically prepare a large quantity of a limited number of entrees, vegetables, and desserts, according to preset menus, they do sometimes customize meals according to diners’ dietary considerations.","id":"ckc.US.base-1.09-4","soc":"35-2012.00","name":"Cook, Institution and Cafeteria"},{"en":"Restaurant cooks prepare a wide selection of dishes and cook most orders individually. Some may order supplies and help maintain the stock room.","id":"ckc.US.base-1.09-5","soc":"35-2014.00","name":"Cook, Restaurant"},{"en":"These workers perform many routine tasks under the direction of cooks, chefs, or food service managers. They prepare cold foods, slice meat, peel and cut vegetables, brew coffee or tea, and perform many other food service tasks.","id":"ckc.US.base-1.09-6","soc":"35-2021.00","name":"Food Preparation Worker"},{"en":"These operators control, operate, and maintain machinery to generate electricity. They use control boards to distribute power among generators and regulate the output of several generators. They monitor instruments to maintain voltage and electricity flows from the plant to meet fluctuating consumer demand throughout the day.","id":"ckc.US.base-1.1-1","soc":"51-8013.00","name":"Power Plant Operator"},{"en":"Also known as marine design engineers or marine mechanical engineers, they are responsible for the operation and maintenance of internal systems of a ship, such as the propulsion, electrical, refrigeration, and steering systems.","id":"ckc.US.base-1.1-2","soc":"53-5031.00","name":"Ship Engineer"},{"en":"These workers start up, regulate, repair, and shut down equipment, mostly in large facilities found in manufacturing, government, education institutions, and hospitals. They monitor meters, gauges, and computerized controls to ensure that equipment operates safely and within established limits. They use sophisticated electrical and electronic test equipment to service, troubleshoot, repair, and monitor heating, cooling, and ventilation systems.","id":"ckc.US.base-1.1-3","soc":"51-8021.00","name":"Stationary Engineer and Boiler Operator"},{"en":"These operators work in water treatment plants, which treat and distribute fresh water to customers that is pumped from wells, rivers, streams, or reservoirs. They run the equipment and control and monitor the processes so the water is safe to drink.","id":"ckc.US.base-1.1-4","soc":"51-8031.00","name":"Water Treatment Plant Operator"},{"en":"These operators use a variety of farm equipment to plow and sow seeds, as well as maintain and harvest crops. They may use tractors, fertilizer spreaders, balers, combines, threshers, and trucks. These workers also operate machines such as conveyor belts, loading machines, separators, cleaners, and dryers. They may make adjustments and minor repairs to equipment.","id":"ckc.US.base-1.11-1","soc":"45-2091.00","name":"Agricultural Equipment Operator"},{"en":"Operating engineers and other operators work with one or several types of power construction equipment. They may operate excavation and loading machines equipped with scoops, shovels, or buckets that dig sand, gravel, earth, or similar materials. In addition to operating bulldozers, they operate trench excavators, road graders, and similar equipment.","id":"ckc.US.base-1.11-2","soc":"47-2073.00","name":"Construction Equipment Operator"},{"en":"These operators use tower and cable equipment to lift and move materials, machinery, or other heavy objects. From a control station, operators can extend and retract horizontal booms, rotate the superstructure, and lower and raise hooks attached to cables at the end of their crane or tower. Operators usually are guided by workers on the ground who use hand signals or who transmit voice signals through a radio.","id":"ckc.US.base-1.11-3","soc":"53-7021.00","name":"Crane and Tower Operator"},{"en":"These operators drive excavation and loading machines equipped with scoops, shovels, or buckets that dig sand, gravel, earth, or similar materials. In addition to operating bulldozers, they operate trench excavators, road graders, and similar equipment.","id":"ckc.US.base-1.11-4","soc":"47-2073.00","name":"Grader, Bulldozer, or Scraper Operator"},{"en":"These drivers transport goods from one location to another. Most are long-haul drivers and operate trucks with a gross vehicle weight (GVW) capacity of more than 26,000 pounds. These drivers deliver goods over intercity routes, sometimes spanning several states.","id":"ckc.US.base-1.11-5","soc":"53-7051.00","name":"Industrial Truck & Tractor Operator"},{"en":"These operators control the machines that spread and level asphalt or spread and smooth concrete for roadways or other structures.","id":"ckc.US.base-1.11-6","soc":"47-2071.00","name":"Paving Equipment Operator"},{"en":"These operators load and unload chemicals and bulk solids, such as coal, sand, and grain into or from tank cars, trucks, or ships using material moving equipment. They may also gauge or sample shipping tanks and test them for leaks.","id":"ckc.US.base-1.11-7","soc":"53-7121.00","name":"Tank Car, Truck, or Ship Loader"},{"en":"Dental laboratory technicians use traditional or digital impressions or molds of a patient’s teeth to create crowns, bridges, dentures, and other dental appliances. Ophthalmic laboratory technicians, also called manufacturing opticians or optical mechanics, make prescription eyeglasses and contact lenses. Some manufacture lenses for optical instruments like telescopes and binoculars.","id":"ckc.US.base-1.12-1","soc":"51-9081.00","name":"Dental or Ophthalmic Laboratory Technician"},{"en":"These assemblers build products such as electric motors, computers, electronic control devices, and sensing equipment. They often use automated systems because many electronic parts are too small or fragile for human assembly. Much of the work is done by hand during the small-scale production of electronic devices used in all types of aircraft, military systems, and medical equipment.","id":"ckc.US.base-1.12-2","soc":"51-2022.00","name":"Electrical or Electronic Equipment Assembler"},{"en":"These assemblers assemble and modify electromechanical devices such as household appliances, computer tomography scanners, or vending machines using a variety of tools like rulers, rivet guns, and soldering irons.","id":"ckc.US.base-1.12-3","soc":"51-2023.00","name":"Electromechanical Equipment Assembler"},{"en":"These assemblers construct, assemble, and rebuild engines, turbines, and machines used in automobiles, construction and mining equipment, and power generators. Aircraft structure, surfaces, rigging, and systems assemblers fit, fasten, and install parts of airplanes, space vehicles, or missiles, such as the wings, fuselage, landing gear, rigging and control equipment, and heating and ventilating systems.","id":"ckc.US.base-1.12-4","soc":"51-2031.00","name":"Engine or Other Machine Assembler"},{"en":"Inspectors mark, tag, or note problems. They may reject defective items outright, send them for repair, or fix minor problems themselves. If the product is acceptable, the inspector certifies it. Testers repeatedly test existing products or prototypes under real-world conditions. Through these tests, manufacturers determine how long a product will last, what parts will break down first, and how to improve durability.","id":"ckc.US.base-1.12-5","soc":"51-9061.00","name":"Inspector or Tester"},{"en":"Machine setters, or setup workers, prepare the machines before production, perform test runs, and, if necessary, adjust and make minor repairs to the machinery before and during operation. Machine operators and tenders monitor the machinery during operation.","id":"ckc.US.base-1.12-6","soc":"51-4081.00","name":"Machine Setter, Operator, and Tender"},{"en":"Model makers set up and operate machines, such as milling and engraving machines to make working models of metal or plastic objects. Patternmakers lay out, machine, fit, and assemble castings and parts to metal or plastic foundry patterns and core molds.","id":"ckc.US.base-1.12-7","soc":"51-4061.00","name":"Model Makers, Metal or Plastic"},{"en":"Printing press operators set up and operate digital, letterpress, lithographic, flexographic, gravure, or other printing machines. They also operate short-run offset printing presses.","id":"ckc.US.base-1.12-8","soc":"51-5112.00","name":"Printing Press Operator"},{"en":"Woodworkers manufacture a variety of products such as cabinets and furniture, using wood, veneers, and laminates. They often combine and incorporate different materials into wood.","id":"ckc.US.base-1.12-9","soc":"51-7099.00","name":"Woodworker"},{"en":"Astronomers study planets, stars, galaxies, and other celestial bodies. They use ground-based equipment, such as radio and optical telescopes, and space-based equipment, such as the Hubble Space Telescope. Some study distant stars, galaxies, and phenomena such as neutron stars and black holes, and others monitor space debris that could interfere with satellite operations.","id":"ckc.US.base-2.01-1","soc":"19-2011.00","name":"Astronomer"},{"en":"Physicists explore the fundamental properties and laws that govern space, time, energy, and matter. Some study theoretical areas, such as the fundamental properties of atoms and molecules. Others design and perform experiments with sophisticated equipment like particle accelerators, electron microscopes, and lasers. Many apply their knowledge of physics to practical objectives, such as developing advanced materials and medical equipment.","id":"ckc.US.base-2.01-10","soc":"19-2012.00","name":"Physicist"},{"en":"Soil conservationists give technical help to people who want to conserve soil and related natural resources. For private landowners, they develop programs to make the most productive use of land without damaging it. They help private landowners and governments by advising on erosion, water quality, preserving water supplies, preventing ground-water contamination, and conserving water.","id":"ckc.US.base-2.01-11","soc":"19-1031.01","name":"Soil Conservationist"},{"en":"Atmospheric scientists study the weather and climate, and examine how those conditions affect human activity and the earth in general. They may develop forecasts, collect and compile data from the field, assist in the development of new data collection instruments, or advise clients on risks or opportunities caused by weather events and climate change.","id":"ckc.US.base-2.01-2","soc":"19-2021.00","name":"Atmospheric or Space Scientist"},{"en":"Chemists study substances at the atomic and molecular levels and analyze the ways in which they interact with one another. They use their knowledge to develop new and improved products and to test the quality of manufactured goods. There are different types of chemists: analytical, forensic, medicinal, physical, inorganic and organic.","id":"ckc.US.base-2.01-3","soc":"19-2031.00","name":"Chemist"},{"en":"Environmental scientists use their knowledge of the natural sciences to protect the environment and human health. They may clean up polluted areas, advise policymakers, or work with industry to reduce waste.","id":"ckc.US.base-2.01-4","soc":"19-2041.00","name":"Environmental Scientist"},{"en":"Geologists study the materials, processes, and history of the Earth. They investigate how rocks were formed and what has happened to them since their formation. There are subgroups of geologists like stratigraphers, who study stratified rock, and mineralogists, who study the structure and composition of minerals.","id":"ckc.US.base-2.01-5","soc":"19-2042.00","name":"Geologist"},{"en":"Geophysicists use the principles of physics to learn about the Earth’s surface and interior. They also study the properties of Earth’s magnetic, electric, and gravitational fields.","id":"ckc.US.base-2.01-6","soc":"19-2042.00","name":"Geophysicist"},{"en":"Geoscientists study the physical aspects of the Earth, such as its composition, structure, and processes, to learn about its past, present, and future.","id":"ckc.US.base-2.01-7","soc":"19-2042.00","name":"Geoscientist"},{"en":"Hydrologists study how water moves across and through the Earth’s crust. They study how rain, snow, and other forms of precipitation impact river flows or groundwater levels, and how surface water and groundwater evaporate back into the atmosphere or eventually reach the oceans. They analyze how water influences the surrounding environment and use their expertise to solve problems concerning water quality and availability.","id":"ckc.US.base-2.01-8","soc":"19-2043.00","name":"Hydrologist"},{"en":"Materials scientists study the structures and chemical properties of various materials to develop new products or enhance existing ones. They determine ways to strengthen or combine existing materials, or develop new materials for use in a variety of products. Applications of materials science include inventing or improving ceramics, plastics/polymers, metallic alloys, and superconducting materials.","id":"ckc.US.base-2.01-9","soc":"19-2032.00","name":"Materials Scientist"},{"en":"Animal scientists typically conduct research on domestic farm animals. With a focus on food production, they explore animal genetics, nutrition, reproduction, diseases, growth, and development. They work to develop efficient ways to produce and process meat, poultry, eggs, and milk.  This includes advising farmers on how to upgrade housing for animals, lower animal death rates, increase growth rates, or otherwise increase the quality and efficiency of livestock.","id":"ckc.US.base-2.02-1","soc":"19-1011.00","name":"Animal Scientist"},{"en":"Biochemists, sometimes called molecular biologists or cellular biologists, may study the molecular mechanisms by which cells feed, divide, and grow. Others study the evolution of plants and animals, to understand how genetic traits are carried through successive generations.  Biophysicists may conduct basic research to learn how nerve cells communicate or how proteins work. These scientists may work in industry,  government, and universities.","id":"ckc.US.base-2.02-2","soc":"19-1021.00","name":"Biochemist or Biophysicist"},{"en":"Conservation scientists manage, improve, and protect the country’s natural resources. They work with private landowners and federal, state, and local governments to find ways to use and improve the land while safeguarding the environment.","id":"ckc.US.base-2.02-3","soc":"19-1031.00","name":"Conservation Scientist"},{"en":"These scientists use chemistry, biology, and other sciences to study the basic elements of food. They analyze the nutritional content of food, discover new food sources, and research ways to make processed foods safe and healthy. Food technologists generally work in product development, applying findings from food science research to develop new or better ways of selecting, preserving, processing, packaging, and distributing food.","id":"ckc.US.base-2.02-4","soc":"19-1012.00","name":"Food Scientist or Technologist"},{"en":"These scientists conduct research aimed at improving overall human health. They often use clinical trials and other investigative methods to reach their findings. They design and conduct studies that investigate both human diseases and methods to prevent and treat them.","id":"ckc.US.base-2.02-5","soc":"19-1042.00","name":"Medical Scientist"},{"en":"Microbiologists study microorganisms such as bacteria, viruses, algae, fungi, and some types of parasites. They try to understand how these organisms live, grow, and interact with their environments.","id":"ckc.US.base-2.02-6","soc":"19-1022.00","name":"Microbiologist"},{"en":"Range managers typically conduct research on and study range land management practices. They focus on how to protect, improve and sustain the production of forage, livestock and wildlife.","id":"ckc.US.base-2.02-7","soc":"19-1031.02","name":"Range Manager"},{"en":"Soil scientists examine the composition of soil, how it affects plant or crop growth, and how alternative soil treatments affect crop productivity. They develop methods of conserving and managing soil that farmers and forestry companies can use. Plant scientists work to improve crop yields and advise food and crop developers about techniques that could enhance production. They may develop ways to control pests and weeds.","id":"ckc.US.base-2.02-8","soc":"19-1013.00","name":"Soil or Plant Scientist"},{"en":"Zoologists and wildlife biologists study animals and other wildlife and how they interact with their ecosystems. They study the physical characteristics of animals, animal behaviors, and the impacts humans have on wildlife and natural habitats.","id":"ckc.US.base-2.02-9","soc":"19-1023.00","name":"Zoologist or Wildlife Biologist"},{"en":"An allergist is a doctor specially trained to diagnose, treat and manage allergies, asthma and disorders of the immune system.  Conditions range from the very common to the very rare, spanning all ages and encompassing various organ systems.","id":"ckc.US.base-2.03-1","soc":"29-1069.01","name":"Allergist"},{"en":"Optometrists examine the eyes and other parts of the visual system. They also diagnose and treat visual problems and manage diseases, injuries, and other disorders of the eyes. They prescribe eyeglasses or contact lenses as needed.","id":"ckc.US.base-2.03-10","soc":"29-1041.00","name":"Optometrist"},{"en":"Orthodontists straighten teeth by applying pressure to the teeth with braces or other appliances. These specialty dentists develop treatment plans and follow patients over time to ensure teeth move or stay in place as expected.","id":"ckc.US.base-2.03-11","soc":"29-1023.00","name":"Orthodontist"},{"en":"Pediatricians provide care for infants, children, teenagers, and young adults. They specialize in diagnosing and treating problems specific to younger people. Most treat common illnesses, minor injuries, and infectious diseases, and administer vaccinations. Some specialize in pediatric surgery or serious medical conditions that commonly affect younger patients, such as autoimmune disorders or chronic ailments.","id":"ckc.US.base-2.03-12","soc":"29-1065.00","name":"Pediatrician"},{"en":"Pharmacists dispense prescription medications to patients and offer expertise in the safe use of prescriptions. They also may conduct health and wellness screenings, provide immunizations, oversee the medications given to patients, and provide advice about healthy lifestyles.","id":"ckc.US.base-2.03-13","soc":"29-1051.00","name":"Pharmacist"},{"en":"These doctors diagnose and treat injuries or illnesses. Physicians examine patients; take medical histories; prescribe medications; and order, perform, and interpret diagnostic tests. Surgeons operate on patients to treat injuries, such as broken bones; diseases, such as cancerous tumors; and deformities, such as cleft palates.","id":"ckc.US.base-2.03-14","soc":"29-1069.00","name":"Physician or Surgeon"},{"en":"Psychiatrists are primary mental health physicians. They diagnose and treat mental illnesses through a combination of personal counseling (psychotherapy), psychoanalysis, hospitalization, and medication. Psychotherapy involves regular discussions with patients about their problems. The psychiatrist helps them find solutions through changes in their behavioral patterns, explorations of their past experiences, or group and family therapy sessions.","id":"ckc.US.base-2.03-15","soc":"29-1067.00","name":"Psychiatrist"},{"en":"Surgical technologists, also called operating room technicians, assist in surgical operations. They prepare operating rooms, arrange equipment, and help doctors during surgeries.  They prepare the operating room by setting up surgical instruments and equipment. They also prepare patients for surgery and answer their questions.","id":"ckc.US.base-2.03-16","soc":"29-2055.00","name":"Surgical Technologist"},{"en":"Veterinarians care for the health of animals and work to protect public health. They diagnose, treat, and research medical conditions and diseases of pets, livestock, and other animals.","id":"ckc.US.base-2.03-17","soc":"29-1131.00","name":"Veterinarian"},{"en":"Veterinary technologists and technicians, supervised by licensed veterinarians, do medical tests that help diagnose animals’ injuries and illnesses. Typically working with small-animal practitioners who care for cats and dogs, they also may have tasks that involve mice, cattle, or other animals.","id":"ckc.US.base-2.03-18","soc":"29-2056.00","name":"Veterinary Technologist or Technician"},{"en":"These doctors focus on the care of surgical patients and pain relief. They administer drugs (anesthetics) that reduce or eliminate the sensation of pain during an operation or another medical procedure. During surgery, they are responsible for adjusting the amount of anesthetic as needed, and monitoring the patient's heart rate, body temperature, blood pressure, and breathing.","id":"ckc.US.base-2.03-2","soc":"29-1061.00","name":"Anesthesiologist"},{"en":"Audiologists diagnose, manage, and treat a patient’s hearing, balance, or related ear problems. They use audiometers, computers, and other devices to test patients’ hearing ability and balance. They try to identify the extent of hearing damage and its underlying cause, and recommend ways to address it.","id":"ckc.US.base-2.03-3","soc":"29-1181.00","name":"Audiologist"},{"en":"Cardiologists are doctors who specialize in diagnosing and treating heart problems.","id":"ckc.US.base-2.03-4","soc":"29-1069.00","name":"Cardiologist"},{"en":"Chiropractors care for patients with health problems of the neuromusculoskeletal system, which includes nerves, bones, muscles, ligaments, and tendons. They use spinal adjustments and manipulation, as well as other clinical interventions, to manage patients’ health concerns, such as back and neck pain.","id":"ckc.US.base-2.03-5","soc":"29-1011.00","name":"Chiropractor"},{"en":"Dentists diagnose and treat problems with patients’ teeth, gums, and related parts of the mouth. They provide advice and instruction on taking care of the teeth and gums and on diet choices that affect oral health.","id":"ckc.US.base-2.03-6","soc":"29-1021.00","name":"Dentist"},{"en":"Epidemiologists are public health professionals who investigate patterns and causes of disease and injury in humans. They seek to reduce the risk and occurrence of negative health outcomes through research, community education and health policy.","id":"ckc.US.base-2.03-7","soc":"19-1041.00","name":"Epidemiologist"},{"en":"General internists diagnose and provide nonsurgical treatment for a range of problems that affect internal organ systems such as the stomach, kidneys, liver, and digestive tract. They use a variety of diagnostic techniques to treat patients through medication or hospitalization. Most patients are adults.","id":"ckc.US.base-2.03-8","soc":"29-1063.00","name":"Internist"},{"en":"Obstetricians and gynecologists (OB/GYNs) provide care related to pregnancy, childbirth, and the female reproductive system. They treat and counsel women throughout their pregnancy and deliver babies. They also diagnose and treat health issues specific to women, such as breast cancer, cervical cancer, hormonal disorders, and symptoms related to menopause.","id":"ckc.US.base-2.03-9","soc":"29-1064.00","name":"Obstetrician"},{"en":"Biological technicians, sometimes called laboratory assistants, are typically responsible for doing scientific tests, experiments, and analyses under the supervision of biologists (such as microbiologists) or medical scientists who direct and evaluate their work.","id":"ckc.US.base-2.04-1","soc":"19-4021.00","name":"Biological Technician"},{"en":"Medical laboratory technologists (also known as medical laboratory scientists) and medical laboratory technicians collect samples and perform tests to analyze body fluids, tissue, and other substances.","id":"ckc.US.base-2.04-10","soc":"29-2012.00","name":"Medical Laboratory Technician"},{"en":"Nuclear medicine technologists prepare radioactive drugs and administer them to patients for imaging or therapeutic purposes. They provide technical support to physicians or other professional nuclear medicine personnel in the diagnosis, care, and treatment of patients and for research and investigation into the uses of radioactive drugs.","id":"ckc.US.base-2.04-11","soc":"29-2033.00","name":"Nuclear Medicine Technologist"},{"en":"Phlebotomists draw blood for tests, transfusions, research, or blood donations. Some explain their work to patients and provide assistance if they have adverse reactions after their blood is drawn.","id":"ckc.US.base-2.04-12","soc":"31-9097.00","name":"Phlebotomist"},{"en":"These technicians create images and conduct tests involving the heart and lungs. Some monitor patients’ heart rates and help physicians in diagnosing and treating problems with patients’ hearts. They assist with cardiac catheterization, which involves threading a catheter through a patient’s artery to the heart. Others specialize in electrocardiogram (EKG) testing.","id":"ckc.US.base-2.04-2","soc":"29-2031.00","name":"Cardiovascular Technologist or Technician"},{"en":"These technicians use laboratory instruments and techniques to help chemists and chemical engineers research, develop, produce, and test chemical products and processes.","id":"ckc.US.base-2.04-3","soc":"19-4031.00","name":"Chemical Technician"},{"en":"Both technicians and technologists perform tests and procedures that physicians and surgeons or other healthcare personnel order. However, technologists perform more complex tests and laboratory procedures than technicians do. For example, technologists may prepare specimens and perform detailed manual tests, whereas technicians perform routine, often automated tests.","id":"ckc.US.base-2.04-4","soc":"29-2012.00","name":"Clinical Laboratory Technician"},{"en":"Technologists perform more complex, manual tests and procedures that physicians and surgeons or other healthcare personnel order. Here are two examples: clinical chemistry technologists prepare specimens and analyze the chemical and hormonal contents of body fluids; cytotechnologists prepare slides of body cells and examine these cells under a microscope for abnormalities that may signal the beginning of a cancerous growth.","id":"ckc.US.base-2.04-5","soc":"29-2011.00","name":"Clinical Laboratory Technologist"},{"en":"These workers specialize in creating images  (sonograms or ultrasounds) of the body’s organs and tissues, often the first imaging tests performed when disease is suspected. They use an instrument called an ultrasound transducer to scan parts of the patient’s body. It emits pulses of sound that bounce back, causing echoes. The echoes are then sent to an ultrasound machine, which processes them and displays them as images used by physicians for diagnosis.","id":"ckc.US.base-2.04-6","soc":"29-2032.00","name":"Diagnostic Medical Sonographer"},{"en":"These technicians monitor the environment and investigate sources of pollution and contamination, including those affecting public health. They often work on teams with scientists, engineers, and technicians in other fields to solve complex problems related to environmental degradation and public health.","id":"ckc.US.base-2.04-7","soc":"19-4091.00","name":"Environmental Science or Protection Technician"},{"en":"These technicians aid criminal investigations by collecting and analyzing evidence. Many specialize in either crime scene investigation or laboratory analysis. Most who perform laboratory analysis specialize in a specific type of evidence, such as DNA or ballistics.","id":"ckc.US.base-2.04-8","soc":"19-4092.00","name":"Forensic Science Technician"},{"en":"These technicians support scientists and engineers exploring and extracting natural resources like oil and natural gas. They may work on geological prospecting and surveying teams, or work with environmental scientists and technicians to monitor the environmental impact of drilling and other activities.","id":"ckc.US.base-2.04-9","soc":"19-4041.00","name":"Geological or Petroleum Technician"},{"en":"These scientists invent and design new approaches to computing technology and find innovative uses for existing technology. They study and solve complex problems in computing for business, science, medicine, and other fields. Their work often leads to technological advancements and efficiencies, such as better networking and improved information security. In general, they work at a more theoretical level than other computer professionals.","id":"ckc.US.base-2.05-1","soc":"15-1111.00","name":"Computer or Information Scientist"},{"en":"These developers design computer applications, such as word processors and games, for consumers. They may create custom software for a specific customer or commercial software to be sold to the general public. Some create complex databases for organizations. They also create programs that people use over the Internet and within a company’s intranet.","id":"ckc.US.base-2.05-10","soc":"15-1132.00","name":"Software Developer, Applications"},{"en":"These developers create the systems that keep computers functioning properly. Example: operating systems for computers that the general public buys or systems built specifically for an organization. Often, they also build the system’s interface, which allows users to interact with the computer. These developers create the operating systems that control most of the consumer electronics in use today, including those used by cell phones and cars.","id":"ckc.US.base-2.05-11","soc":"15-1133.00","name":"Software Developer, Systems Software"},{"en":"Web developers design and create websites. They are responsible for the look of the site and its technical aspects like its performance and capacity, which are measures of a website’s speed and how much traffic the site can handle.","id":"ckc.US.base-2.05-12","soc":"15-1134.00","name":"Web Developer"},{"en":"These programmers write and test code that allows computer applications and software programs to function properly. They turn the program designs created by software developers and engineers into instructions a computer can follow. They also perform testing and fix bugs (defects) in the code.","id":"ckc.US.base-2.05-2","soc":"15-1131.00","name":"Computer Programmer"},{"en":"These specialists provide help and advice to computer users and organizations. They either support computer networks or  provide technical assistance directly to computer users.","id":"ckc.US.base-2.05-3","soc":"15-1151.00","name":"Computer Support Specialist"},{"en":"These analysts, sometimes called systems architects, study an organization’s current computer systems and procedures, and design solutions to help the organization operate more efficiently and effectively. They bring business and information technology (IT) together by understanding the needs and limitations of both.","id":"ckc.US.base-2.05-4","soc":"15-1121.00","name":"Computer Systems Analyst"},{"en":"These specialists, also called technical support specialists, analyze, troubleshoot, and evaluate computer network problems. They play an important role in the routine maintenance of their organization’s networks like performing file backups on the network.","id":"ckc.US.base-2.05-5","soc":"15-1152.00","name":"Computer Network Support Specialist"},{"en":"Database administrators use specialized software to store and organize data, such as financial information and customer shipping records. They make sure that data is available to users and secure from unauthorized access.","id":"ckc.US.base-2.05-6","soc":"15-1141.00","name":"Database Administrator"},{"en":"These analysts plan and carry out security measures to protect an organization’s computer networks and systems. They are heavily involved with creating their organization’s disaster recovery plan, a procedure that IT employees follow in case of emergency. These plans enable an organization’s IT department to continue operation.","id":"ckc.US.base-2.05-7","soc":"15-1122.00","name":"Information Security Analyst"},{"en":"These administrators are responsible for the day-to-day operation of an organization's computer networks. They organize, install, and support computer systems, including local area networks (LANs), wide area networks (WANs), network segments, intranets, and other data communication systems.","id":"ckc.US.base-2.05-8","soc":"15-1142.00","name":"Network & Computer System Administrator"},{"en":"Computer network architects design and build data communication networks, including local area networks (LANs), wide area networks (WANs), and Intranets. These networks range from small connections between two offices to next-generation networking capabilities such as a cloud infrastructure that serves multiple customers.","id":"ckc.US.base-2.05-9","soc":"15-1143.00","name":"Network Architect or Engineer"},{"en":"Actuaries analyze the financial costs of risk and uncertainty. They use mathematics, statistics, and financial theory to assess the risk of potential events, and they help businesses and clients develop policies that minimize the cost of that risk. Their work is essential to the insurance industry.","id":"ckc.US.base-2.06-1","soc":"15-2011.00","name":"Actuary"},{"en":"Mathematicians and statisticians apply theories and techniques, such as mathematical or statistical modeling, to solve practical problems. Typically, they work with individuals in other occupations to solve these problems. For example, they may work with chemists, materials scientists, and chemical engineers to analyze the effectiveness of new drugs. Others may work with industrial designers to study the aerodynamic characteristics of new automobiles.","id":"ckc.US.base-2.06-2","soc":"15-2021.00","name":"Mathematician"},{"en":"These analysts use advanced mathematical and analytical methods to help organizations solve problems and make better decisions. They must first identify and understand the problem to be solved or the processes to be improved, collecting relevant data from the field and interviewing clients. They show the implications of pursuing different actions and may help achieve consensus on how to proceed.","id":"ckc.US.base-2.06-3","soc":"15-2031.00","name":"Operations Research Analyst"},{"en":"Mathematicians and statisticians apply theories and techniques, such as mathematical or statistical modeling, to solve practical problems. Typically, they work with individuals in other occupations to solve these problems. For example, they may work with chemists, materials scientists, and chemical engineers to analyze the effectiveness of new drugs. Others may work with industrial designers to study the aerodynamic characteristics of new automobiles.","id":"ckc.US.base-2.06-4","soc":"15-2041.00","name":"Statistician"},{"en":"These social scientists study the origin, development, and behavior of humans. They examine the cultures, languages, archeological remains, and physical characteristics of people in various parts of the world.","id":"ckc.US.base-2.07-1","soc":"19-3091.00","name":"Anthropologist or Archaeologist"},{"en":"Survey researchers design surveys and analyze data. Surveys are used to collect factual data, such as employment and salary information, or to ask questions in order to understand people’s opinions, preferences, beliefs, or desires.","id":"ckc.US.base-2.07-10","soc":"19-3022.00","name":"Survey Researcher"},{"en":"Urban and regional planners develop land use plans and programs that help create communities, accommodate population growth, and revitalize physical facilities in towns, cities, counties, and metropolitan areas.","id":"ckc.US.base-2.07-11","soc":"19-3051.00","name":"Urban or Regional Planner"},{"en":"Economists study the production and distribution of resources, goods, and services by collecting and analyzing data, researching trends, and evaluating economic issues.","id":"ckc.US.base-2.07-2","soc":"19-3011.00","name":"Economist"},{"en":"Geographers study the Earth and the distribution of its land, features, and inhabitants. They also examine political or cultural structures and study the physical and human geographic characteristics of regions ranging in scale from local to global.","id":"ckc.US.base-2.07-3","soc":"19-3092.00","name":"Geographer"},{"en":"Historians research, analyze, interpret, and write about the past by studying historical documents and sources. They conduct research and analysis for governments, businesses, individuals, nonprofits, historical associations, and other organizations.","id":"ckc.US.base-2.07-4","soc":"19-3093.00","name":"Historian"},{"en":"These psychologists apply psychology to the workplace by using psychological principles and research methods to solve problems and improve the quality of worklife. They study issues like workplace productivity, management or employee working styles, and employee morale.","id":"ckc.US.base-2.07-5","soc":"19-3032.00","name":"Industrial-Organizational Psychologist"},{"en":"These analysts research and gather data to help a company market its products or services. They gather data on consumer demographics, preferences, needs, and buying habits. They collect data and information using a variety of methods, such as interviews, questionnaires, focus groups, market analysis surveys, public opinion polls, and literature reviews.","id":"ckc.US.base-2.07-6","soc":"13-1161.00","name":"Marketing Research Analyst"},{"en":"These scientists study the origin, development, and operation of political systems. They research political ideas and analyze governments, policies, political trends, and related issues. They also work as policy analysts for organizations that have a stake in policy, such as government, labor unions, and political groups. Using public opinion surveys, economic data, and election results, they try to anticipate the effects of new policies.","id":"ckc.US.base-2.07-7","soc":"19-3094.00","name":"Political Scientist"},{"en":"Psychologists study cognitive, emotional, and social processes and behavior by observing, interpreting, and recording how people relate to one another and to their environments. They use their findings to help improve processes and behaviors.","id":"ckc.US.base-2.07-8","soc":"19-3039.00","name":"Psychologist"},{"en":"Sociologists study society and social behavior by examining the groups, cultures, organizations, social institutions, and processes that develop when people interact and work together.","id":"ckc.US.base-2.07-9","soc":"19-3041.00","name":"Sociologist"},{"en":"These engineers primarily design aircraft, spacecraft, satellites, and missiles. They also create and test prototypes to make sure that they function according to design. They often specialize in areas such as aerodynamic fluid flow; structural design; guidance, navigation, and control; instrumentation and communication; robotics; and propulsion and combustion.","id":"ckc.US.base-2.08-1","soc":"17-2011.00","name":"Aerospace Engineer"},{"en":"These engineers use the principles of engineering, soil science, biology, and chemistry to develop solutions to environmental problems. They work to improve recycling, waste disposal, public health, and water and air pollution control. They also address global issues, such as unsafe drinking water, climate change, and environmental sustainability.","id":"ckc.US.base-2.08-10","soc":"17-2081.00","name":"Environmental Engineer"},{"en":"These engineers develop procedures and design systems to protect people from illness and injury and property from damage. They combine knowledge of engineering and of health and safety to make sure that chemicals, machinery, software, furniture, and other products will not cause harm to people or damage to property.","id":"ckc.US.base-2.08-11","soc":"17-2111.00","name":"Health and Safety Engineer"},{"en":"These engineers find ways to eliminate wastefulness in production processes. They devise efficient systems that integrate workers, machines, materials, information, and energy to make a product or provide a service. They apply their skills to many different situations, from manufacturing to healthcare systems to business administration.","id":"ckc.US.base-2.08-12","soc":"17-2112.00","name":"Industrial Engineer"},{"en":"Management analysts, often called management consultants, propose ways to improve an organization’s efficiency. They advise managers on how to make organizations more profitable through reduced costs and increased revenues.","id":"ckc.US.base-2.08-13","soc":"13-1111.00","name":"Management Analyst"},{"en":"They design, build, and maintain ships, from aircraft carriers to submarines and from sailboats to tankers. Marine design engineers or marine mechanical engineers are responsible for the internal systems of a ship, such as the propulsion, electrical, refrigeration, and steering systems. Naval architects are responsible for the ship design, including the form, structure, and stability of hulls.","id":"ckc.US.base-2.08-14","soc":"17-2121.00","name":"Marine Engineer or Naval Architect"},{"en":"These engineers research and develop the processes, instruments, and systems used to derive benefits from nuclear energy and radiation. Many find industrial and medical uses for radioactive materials—for example, in equipment used in medical diagnosis and treatment. Others specialize in the development of nuclear power sources for ships or spacecraft.","id":"ckc.US.base-2.08-15","soc":"17-2161.00","name":"Nuclear Engineer"},{"en":"These engineers design and develop methods for extracting oil and gas from deposits below the Earth’s surface. Once oil and gas are discovered, they work with geoscientists and other specialists to understand the geologic formation of the rock containing the reservoir. Then they determine the drilling methods, design the drilling equipment, implement the drilling plan, and monitor operations. They also find new ways to extract oil and gas from older wells.","id":"ckc.US.base-2.08-16","soc":"17-2171.00","name":"Petroleum Engineer"},{"en":"These engineers attempt to solve agricultural problems concerning power supplies, the efficiency of machinery, the use of structures and facilities, pollution and environmental issues, and the storage and processing of agricultural products. Those with computer programming skills work to integrate artificial intelligence and geospatial systems into agriculture.","id":"ckc.US.base-2.08-2","soc":"17-2021.00","name":"Agricultural Engineer"},{"en":"These engineers combine engineering principles with medical and biological sciences to design and create equipment, devices, computer systems, and software used in healthcare. They design electrical circuits, software to run medical equipment, or computer simulations to test new drug therapies. In addition, they design and build artificial body parts, such as hip and knee joints.","id":"ckc.US.base-2.08-3","soc":"17-2031.00","name":"Biomedical Engineer"},{"en":"These engineers apply the principles of chemistry, biology, physics, and math to solve problems that involve the production or use of chemicals, fuel, drugs, food, and many other products. They design processes and equipment for large-scale manufacturing, plan and test production methods and byproducts treatment, and direct facility operations.","id":"ckc.US.base-2.08-4","soc":"17-2041.00","name":"Chemical Engineer"},{"en":"Civil engineers conceive, design, build, supervise, operate, construct and maintain infrastructure projects and systems in the public and private sector, including roads, buildings, airports, tunnels, dams, bridges, and systems for water supply and sewage treatment. Many work in planning, design, construction, research, and education.","id":"ckc.US.base-2.08-5","soc":"17-2051.00","name":"Civil Engineer"},{"en":"These engineers research, design, develop, and test computer systems and components such as processors, circuit boards, memory devices, networks, and routers. Many design devices used in manufactured products that incorporate processors and other computer components and that connect to the Internet.","id":"ckc.US.base-2.08-6","soc":"17-2061.00","name":"Computer Hardware Engineer"},{"en":"These engineers design, develop, test, and supervise the manufacturing of electrical equipment, such as electric motors, radar and navigation systems, communications systems, or power generation equipment. They also design the electrical systems of automobiles and aircraft.","id":"ckc.US.base-2.08-7","soc":"17-2071.00","name":"Electrical Engineer"},{"en":"These engineers design and develop electronic equipment, including broadcast and communications systems, such as portable music players and Global Positioning System (GPS) devices. Many also work in areas closely related to computer hardware.","id":"ckc.US.base-2.08-8","soc":"17-2072.00","name":"Electronics Engineer"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses related to engineering. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-2.08-9","soc":"25-1032.00","name":"Engineering Teacher, Postsecondary"},{"en":"These writers create written content for online or printed publication in a creative genre, like novels, plays, and blogs.","id":"ckc.US.base-3.01-1","soc":"27-3043.05","name":"Creative Writer"},{"en":"Poets write poetry for self or external publication or public reading, submitting their work to contests, inclusion in anthologies and other formats. Some may do education work, giving workshops and teaching classes. Lyricists write song lyrics for publication or performance. They may work with singers, musicians, composers and producers to create songs in a variety of performance settings like theatre, opera, religious worship, and popular culture.","id":"ckc.US.base-3.01-2","soc":"27-3043.05","name":"Poet or Lyricist"},{"en":"Many writers and authors are self-employed or freelance. They sell their written content to book and magazine publishers; news organizations; advertising agencies; and movie, theater, and television producers. They may be hired to complete specific short-term or recurring assignments, such as writing a newspaper column, contributing to a series of articles in a magazine, or producing an organization’s newsletter.","id":"ckc.US.base-3.01-3","soc":"27-3043.00","name":"Writer or Author"},{"en":"Architects plan and design houses, factories, office buildings, and other structures. They work on public or private projects and design both indoor and outdoor spaces. They can be commissioned to design anything from a single room to an entire complex of buildings. They discuss with clients the objectives, requirements, and budget of a project.","id":"ckc.US.base-3.02-1","soc":"17-1011.00","name":"Architect"},{"en":"Fine artists, including painters, sculptors, and illustrators, often strive to communicate ideas or feelings by creating original works of art for their aesthetic value, rather than for a functional one. They use a variety of materials and techniques to create art for sale and exhibition and create objects that are beautiful, thought provoking, and sometimes shocking.","id":"ckc.US.base-3.02-10","soc":"27-1013.00","name":"Fine Artist -- Painter, Sculptor, or Illustrator"},{"en":"Floral designers, also called florists, arrange live, dried, and silk flowers and greenery to make decorative displays. They also help customers select flowers and containers, ribbons, and other accessories. They may create a single arrangement for a specific purpose or multiple displays for special occasions, such as weddings or funerals. They use artistry and their knowledge of different types of blooms to choose appropriate flowers or plants for each occasion.","id":"ckc.US.base-3.02-11","soc":"27-1023.00","name":"Floral Designer"},{"en":"Graphic designers create visual concepts, using computer software or by hand, to communicate ideas that inspire, inform, and captivate consumers. They develop the overall layout and production design for applications such as advertisements, brochures, magazines, and reports.","id":"ckc.US.base-3.02-12","soc":"27-1024.00","name":"Graphic Designer"},{"en":"Interior designers make indoor spaces functional, safe, and beautiful by determining space requirements and selecting essential and decorative items, such as colors, lighting, and materials. They must be able to draw, read, and edit blueprints. They also must be aware of building codes, inspection regulations, and other considerations, such as accessibility standards.","id":"ckc.US.base-3.02-13","soc":"27-1025.00","name":"Interior Designer"},{"en":"Landscape architects design attractive and functional public parks, gardens, playgrounds, residential areas, college campuses, and public spaces. They also plan the locations of buildings, roads, walkways, flowers, shrubs, and trees within these environments. They design these areas so that they are not only easy to use but also harmonious with the natural environment.","id":"ckc.US.base-3.02-14","soc":"17-1012.00","name":"Landscape Architect"},{"en":"Medical illustrators work with computers or with pen and paper to create images of human anatomy and surgical procedures, as well as three-dimensional models and animations. Scientific illustrators draw animal and plant life, atomic and molecular structures, and geologic and planetary formations. These illustrations are used in medical and scientific publications and in audiovisual presentations. Some work for lawyers, producing exhibits for court cases.","id":"ckc.US.base-3.02-15","soc":"27-1013.00","name":"Medical and Scientific Illustrator"},{"en":"Multimedia artists and animators often work in a specific medium. Some focus on creating animated movies or video games. Others create visual effects for movies and television shows. Creating computer-generated images (known as CGI) may include taking images of an actor’s movements and then animating them into three-dimensional characters. Other animators design scenery or backgrounds for locations.","id":"ckc.US.base-3.02-16","soc":"27-1014.00","name":"Multi-Media Artist or Animator"},{"en":"Photographers use their technical expertise, creativity, and composition skills to produce and preserve images that tell a story or record an event. Those who work for commercial clients often present photographs in a digital format to the client. For weddings/portraits, they may provide framing and create albums. Many are self-employed with additional responsibilities of running a business, like marketing, scheduling appointments, and hiring assistants.","id":"ckc.US.base-3.02-17","soc":"27-4021.00","name":"Photographer"},{"en":"Scientific photographers capture scientific or medical data or phenomena. Because they focus on accurately representing subjects visually, these photographers limit the use of software to clarify an image. Those who take pictures of objects too small to be seen with the naked eye use microscopes to photograph their subjects.","id":"ckc.US.base-3.02-18","soc":"27-4021.00","name":"Scientific Photographer"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses related to architecture. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-3.02-2","soc":"25-1031.00","name":"Architecture Teacher, Postsecondary"},{"en":"Art directors are responsible for the visual style and images in magazines, newspapers, product packaging, advertising, video games, and movie and television productions. They determine how a message is communicated visually to its audience by articulating their vision to the artists they oversee. Artists then create images, such as illustrations, graphics, photographs, or charts and graphs, or design stage and movie sets, according to that vision.","id":"ckc.US.base-3.02-3","soc":"27-1011.00","name":"Art Director"},{"en":"Craft artists create handmade objects, such as pottery, glassware, textiles, and other objects that are designed to be functional. They work with many different materials, including ceramics, glass, textiles, wood, metal, and paper, to create unique pieces of art, such as pottery, quilts, stained glass, furniture, jewelry, and clothing. Many use fine-art techniques like painting, sketching, and printing to add finishing touches to their products.","id":"ckc.US.base-3.02-4","soc":"27-1013.00","name":"Artist"},{"en":"Cartoonists draw political, advertising, comic, and sports cartoons. Some cartoonists work with others who create the idea or story and write captions. Some create plots and write captions themselves. Most cartoonists have comic, critical, or dramatic talents, in addition to drawing skills.","id":"ckc.US.base-3.02-5","soc":"27-1013.00","name":"Cartoonist"},{"en":"Industrial designers develop the concepts for manufactured products, such as cars, home appliances, and toys. They combine art, business, and engineering to make products that people use every day. They consider the function, aesthetics, production costs, and usability of products when developing new product concepts.","id":"ckc.US.base-3.02-6","soc":"27-1021.00","name":"Commercial or Industrial Designer"},{"en":"Desktop publishers use computer software to design page layouts for newspapers, books, brochures, and other items that are printed or published online. They often work with graphic designers to come up with images that complement the text and fit the available space.","id":"ckc.US.base-3.02-7","soc":"43-9031.00","name":"Desktop Publisher"},{"en":"These designers create original clothing, accessories, and footwear, sketching designs, selecting fabrics/patterns, and instructing how to make designs. Although most first sketch their designs by hand, many now also sketch their ideas digitally with computer-aided design (CAD) programs. CAD allows them to see their work on virtual models, trying different colors, designs, and shapes more easily than they could when working with real fabric on real people.","id":"ckc.US.base-3.02-8","soc":"27-1022.00","name":"Fashion Designer"},{"en":"These editors manipulate images that entertain or inform an audience. They arrange footage shot by camera operators and collaborate with producers and directors to create the final content. They often have assistants, who help keep track of each shot in a database or load digital video into an editing bay. Nearly all editing work is done on a computer, and editors often are trained in a specific type of editing software.","id":"ckc.US.base-3.02-9","soc":"27-4032.00","name":"Film or Video Editor"},{"en":"Actors express ideas and portray characters in theater, film, television, and other performing arts media. They interpret a writer’s script to entertain or inform an audience. Most struggle to find steady work, and few achieve recognition as stars. Some work as “extras”—actors who have no lines to deliver but are included in scenes to give a more realistic setting. Some actors do voiceover or narration work for animated features, audiobooks, or other electronic media.","id":"ckc.US.base-3.03-1","soc":"27-2011.00","name":"Actor"},{"en":"Choreographers create original dances and develop new interpretations of existing dances. They work in dance schools, theaters, dance companies, and movie studios. During rehearsals, they typically demonstrate dance moves, to instruct dancers in the proper technique. Some work with performers not trained in dance. For example, the complex martial arts scenes performed by actors in movies are arranged by choreographers specializing in martial arts.","id":"ckc.US.base-3.03-2","soc":"27-2032.00","name":"Choreographer"},{"en":"Dancers use dance performances to express ideas and stories. They spend years learning dances and perfecting their skills. They usually perform as part of a group and know a variety of dance styles such as ballet, tango, modern dance, tap, and jazz. In addition to traditional performances in front of a live audience, many perform on TV, in videos on the Internet, and in music videos. Many perform in shows at casinos, in theme parks, and on cruise ships.","id":"ckc.US.base-3.03-3","soc":"27-2031.00","name":"Dancer"},{"en":"Directors are responsible for the creative decisions of a production. They select cast members, conduct rehearsals, and direct the work of the cast and crew. During rehearsals, they work with the actors to help them portray their characters more accurately. They also work with cinematographers and other crew members to ensure that the final product matches the overall vision.","id":"ckc.US.base-3.03-4","soc":"27-2012.02","name":"Director  (TV/radio, movies, theater)"},{"en":"These specialists apply makeup to actors, dancers and other performers to fit their role, the time period in which it is set, and the physical setting.","id":"ckc.US.base-3.03-5","soc":"39-5091.00","name":"Makeup Artist, Theatrical & Performance"},{"en":"Models pose for artists, photographers, or customers to help advertise a variety of products, including clothing, cosmetics, food, and appliances. They also work as a fit or fitting model, enabling the manufacturer or fashion designer to achieve the best fit for new styles.","id":"ckc.US.base-3.03-6","soc":"41-9012.00","name":"Model"},{"en":"Composers write music for a variety of types of musical groups and users. Some work in a particular style of music like classical or jazz. They also may write for musicals, operas, or other types of theatrical productions. Some write scores for movies or television; others write jingles for commercials. Many focus on composing music for audiences of popular music.","id":"ckc.US.base-3.04-1","soc":"27-2041.04","name":"Composer"},{"en":"Similar to composers, arrangers use music theory to balance voices, melodies, harmonies, and other music elements to make a composition. They may use different kinds of equipment and software to experiment and refine their work. Orchestrators arrange music for orchestras, deciding how to assign instruments to play parts of a music composition and other adaptations.","id":"ckc.US.base-3.04-2","soc":"27-2041.04","name":"Music Arranger or Orchestrator"},{"en":"Music directors lead orchestras, choirs, and other musical groups. They ensure that musicians play with one coherent sound, balancing the melody, timing, rhythm, and volume. They also give feedback to musicians and section leaders on sound and style.","id":"ckc.US.base-3.04-3","soc":"27-2041.01","name":"Music Director"},{"en":"Musicians play instruments play one or more instruments for live audiences and in recording studios in a variety of styles, such as classical, jazz, opera, hip-hop, and rock. They play solo or in bands, orchestras, or small groups. Those in bands may play at weddings, private parties, clubs, or bars while they try to build enough fans to get a recording contract or representation by an agent.  To make extra money, some give private music lessons to children and adults.","id":"ckc.US.base-3.04-4","soc":"27-2042.00","name":"Musician"},{"en":"Singers perform vocal music in a variety of styles or focus on one style, such as opera or jazz. Some, particularly those who specialize in opera or classical music, may perform in different languages, such as French or Italian. Opera and musical theater singers act out a story by singing instead of speaking the dialogue. Some singers become background singers, providing vocals to harmonize with or support a lead singer.","id":"ckc.US.base-3.04-5","soc":"27-2042.01","name":"Singer"},{"en":"Broadcast news analysts, also called anchors, lead news shows on television or radio. Others are news commentators, who analyze and interpret news stories and offer opinions. Some news commentators come from fields outside of journalism and have expertise in a particular subject—for example, politics, business, or medicine—and are hired on a contract basis to provide their opinion.","id":"ckc.US.base-3.05-1","soc":"27-3021.00","name":"Broadcast News Analyst"},{"en":"Editors plan, coordinate, and revise material for publication in books, newspapers, magazines, or websites. They review story ideas and decide what material will appeal most to readers. During the review process, they offer comments to improve the product, and suggest titles and headlines.","id":"ckc.US.base-3.05-2","soc":"27-3041.00","name":"Editor"},{"en":"These writers are independent and self-employed. They sell their written content to book and magazine publishers; news organizations; advertising agencies; and movie, theater, and television producers. They may be hired to complete specific short-term or recurring assignments, such as writing a newspaper column, contributing to a series of articles in a magazine, or producing an organization’s newsletter.","id":"ckc.US.base-3.05-3","soc":"27-3043.00","name":"Freelance Writer"},{"en":"Interpreters and translators aid communication by converting messages or text from one language into another language. Although some people do both, interpreting and translating are different professions: interpreters work with spoken communication, and translators work with written communication.","id":"ckc.US.base-3.05-4","soc":"27-3091.00","name":"Interpreter or Translator"},{"en":"These announcers entertain audiences to enhance performances or they provide information. Emcees host planned events and introduce speakers or performers to the audience. They may tell jokes or provide commentary to transition from one speaker to the next. Party DJs are hired to provide music and commentary at an event, such as a wedding, a birthday party, or a corporate party. Many DJs use digital files or portable media devices.","id":"ckc.US.base-3.05-5","soc":"27-3012.00","name":"Public Address Announcer, MC, or DJ"},{"en":"These announcers present music or the news and comment on important current events. They are up to date with current events or a specific field like politics or sports. They may research and prepare information on current topics before appearing on air. They also schedule guests on their shows and work with producers to develop other creative content. Some act as masters of ceremonies (emcees) or disc jockeys (DJs) at weddings, parties, or clubs.","id":"ckc.US.base-3.05-6","soc":"27-3011.00","name":"Radio and Television Announcer"},{"en":"Reporters and correspondents, also called journalists, often work for a particular type of media organization, such as a television or radio station, newspaper, or website. Increasingly media outlets rely on multimedia journalists to publish content on a variety of platforms, such as a video content on the website of a daily newspaper. They typically record, report, write, and edit their own stories as well as put together all the audio, video, or graphics.","id":"ckc.US.base-3.05-7","soc":"27-3022.00","name":"Reporter or Correspondent"},{"en":"Technical writers create paper-based and digital operating instructions, how-to manuals, assembly instructions, and “frequently asked questions” pages to help technical support staff, consumers, and other users within a company or an industry. After a product is released, they also may work with product liability specialists and customer-service managers to improve the end-user experience through product design changes.","id":"ckc.US.base-3.05-8","soc":"27-3042.00","name":"Technical or Scientific Editor or Writer"},{"en":"Child and family social workers protect vulnerable children and help families who need help. They help families find housing or services like childcare, or apply for benefits like food stamps. Some help arrange adoptions, locate foster families, or work to reunite families. School social workers work with teachers, parents, and school administrators to develop plans and strategies to improve students’ academic performance and social development.","id":"ckc.US.base-4.01-1","soc":"21-1021.00","name":"Child, Family, or School Social Worker"},{"en":"Marriage and family therapists work with individuals, couples, and families. They bring a family-centered perspective to treatment, even when treating individuals. They evaluate family roles and development, to understand how clients’ families affect their mental health. They treat the clients’ relationships, not just the clients themselves. They address issues like low self-esteem, stress, addiction, and substance abuse.","id":"ckc.US.base-4.01-10","soc":"21-1013.00","name":"Marriage and Family Therapist"},{"en":"Mental health counselors provide treatment to individuals, families, couples, and groups. Some work with specific populations, such as the elderly, college students, or children. They treat clients with a variety of conditions, including anxiety, depression, grief, low self-esteem, stress, and suicidal impulses.","id":"ckc.US.base-4.01-11","soc":"21-1014.00","name":"Mental Health Counselor"},{"en":"Probation officers, also called community supervision officers, supervise people who have been placed on probation instead of sent to prison. They work to ensure that the probationer is not a danger to the community and to help in their rehabilitation. Correctional treatment specialists, also known as case managers or correctional counselors, advise probationers and parolees and develop rehabilitation plans for them to follow.","id":"ckc.US.base-4.01-12","soc":"21-1092.00","name":"Probation Officer or Correctional Treatment Specialist"},{"en":"These counselors help people with physical, mental, developmental, or emotional disabilities live independently. They work with clients to overcome or manage the personal, social, or psychological effects of disabilities on employment or independent living.","id":"ckc.US.base-4.01-13","soc":"21-1015.00","name":"Rehabilitation Counselor"},{"en":"These psychologists apply psychological principles and techniques to education disorders and developmental disorders. They may address student learning and behavioral problems; design and implement performance plans, and evaluate performances; and counsel students and families. They also may consult with other school-based professionals to suggest improvements to teaching, learning, and administrative strategies.","id":"ckc.US.base-4.01-14","soc":"19-3031.01","name":"School Psychologist"},{"en":"These counselors advise people who suffer from alcoholism, drug addiction, eating disorders, mental health issues, or other mental or behavioral problems. They provide treatment and support to help clients recover from addiction or modify problem behaviors.","id":"ckc.US.base-4.01-15","soc":"21-1011.00","name":"Substance Abuse and Behavioral Disorder Counselor"},{"en":"Clergy conduct religious worship based on the beliefs and practices of a religious faith. They provide spiritual guidance, advice, and teaching to others. Some leadership and administrative skills are required for those supervising larger organizations.","id":"ckc.US.base-4.01-2","soc":"21-2011.00","name":"Clergy"},{"en":"These psychologists assess, diagnose, and treat mental, emotional, and behavioral disorders. They help people deal with problems ranging from short-term personal issues to severe, chronic conditions. They often interview patients, give diagnostic tests, and provide individual, family, or group psychotherapy.","id":"ckc.US.base-4.01-3","soc":"19-3031.02","name":"Clinical Psychologist"},{"en":"These psychologists help patients deal with and understand problems, including issues at home, at the workplace, or in their community. Through counseling, these psychologists work with patients to identify their strengths or resources they can use to manage problems.","id":"ckc.US.base-4.01-4","soc":"19-3031.03","name":"Counseling Psychologist"},{"en":"School counselors help students develop the academic and social skills that lead to success in school. Career and educational counselors help people develop skills, explore a career, or choose an educational program that will lead to a career. These counselors help clients improve their overall well-being through successful career and education choices.","id":"ckc.US.base-4.01-5","soc":"21-1012.00","name":"Educational, Vocational, or School Counselor"},{"en":"Eligibility interviewers conduct interviews both in person and over the phone to determine if applicants qualify for government assistance and benefits. They answer applicants’ questions about programs and may refer them to other agencies for assistance.","id":"ckc.US.base-4.01-6","soc":"43-4061.00","name":"Eligibility Interviewer"},{"en":"These counselors assess individual or family risk for a variety of inherited conditions, such as genetic disorders and birth defects. They provide information and support to other healthcare providers, or to individuals and families concerned with the risk of inherited conditions.","id":"ckc.US.base-4.01-7","soc":"29-9092.00","name":"Genetic Counselor"},{"en":"Health educators teach people about behaviors that promote wellness. They develop and implement strategies to improve individual and community health. Also known as health education specialists, they have different duties depending on their work setting. Most work in healthcare facilities, colleges, public health departments, nonprofits, and private businesses. Those who teach health classes in middle and high schools are considered teachers.","id":"ckc.US.base-4.01-8","soc":"21-1091.00","name":"Health Educator"},{"en":"These social workers help patients understand their diagnosis and make the necessary adjustments to their lifestyle, housing, or healthcare. For example, they may help people make the transition from the hospital back to their homes and communities.","id":"ckc.US.base-4.01-9","soc":"21-1022.00","name":"Healthcare Social Worker"},{"en":"Athletic trainers specialize in preventing, diagnosing, and treating muscle and bone injuries and illnesses. Under the direction of a licensed physician, they work with people of all ages and all skill levels, from young children to soldiers and professional athletes. They are usually one of the first healthcare providers on the scene when injuries occur on the field.","id":"ckc.US.base-4.02-1","soc":"29-9091.00","name":"Athletic Trainer"},{"en":"These specialists design and fabricate medical supportive devices and measure and fit patients for them. These devices include artificial limbs (arms, hands, legs, and feet), braces, and other medical or surgical devices. Orthotists work with medical supportive devices, such as spinal or knee braces. Prosthetists work with prostheses, such as artificial limbs and other body parts.","id":"ckc.US.base-4.02-10","soc":"29-2091.00","name":"Orthotist and Prosthetist"},{"en":"Physical therapists, sometimes called PTs, help injured or ill people improve their movement and manage their pain. These therapists are often an important part of rehabilitation, treatment, and prevention of patients with chronic conditions, illnesses, or injuries.","id":"ckc.US.base-4.02-11","soc":"29-1123.00","name":"Physical Therapist"},{"en":"Physical therapist assistants, sometimes called PTAs work under the direction and supervision of physical therapists. They help patients who are recovering from injuries and illnesses regain movement and manage pain.","id":"ckc.US.base-4.02-12","soc":"31-2021.00","name":"Physical Therapy Assistant"},{"en":"Physician assistants, also known as PAs, practice medicine on teams with physicians, surgeons, and other healthcare workers. They examine, diagnose, and treat patients in all areas of medicine and their work depends on their specialty. For example, a physician assistant working in surgery may close incisions and provide care before, during, and after the operation. A physician assistant working in pediatrics may examine a child and give routine vaccinations.","id":"ckc.US.base-4.02-13","soc":"29-1071.00","name":"Physician Assistant"},{"en":"Psychiatric technicians and aides care for people who have mental illness and developmental disabilities. Technicians typically provide therapeutic care and monitor their patients’ conditions. Aides help patients in their daily activities and ensure a safe and clean environment.","id":"ckc.US.base-4.02-14","soc":"29-2053.00","name":"Psychiatric Technician or Aide"},{"en":"Radiation therapists treat cancer and other diseases in patients by administering radiation treatments.They operate machines, such as linear accelerators, to deliver concentrated radiation therapy to the region of a patient’s tumor. Radiation treatment can shrink or remove cancers and tumors.","id":"ckc.US.base-4.02-15","soc":"29-1124.00","name":"Radiation Therapist"},{"en":"Recreational therapists plan, direct, and coordinate recreation-based treatment programs for people with disabilities, injuries, or illnesses. These therapists use a variety of approaches, including arts and crafts; drama, music, and dance; sports and games; aquatics; and community outings to help maintain or improve a patient’s physical, social, and emotional well-being.","id":"ckc.US.base-4.02-16","soc":"29-1125.00","name":"Recreational Therapist"},{"en":"Registered nurses (RNs) provide and coordinate patient care, educate patients and the public about various health conditions, and provide advice and emotional support to patients and their family members. Most work as part of a team with physicians and other healthcare specialists.","id":"ckc.US.base-4.02-17","soc":"29-1141.00","name":"Registered Nurse"},{"en":"Respiratory therapists care for patients who have trouble breathing—for example, from a chronic respiratory disease, such as asthma or emphysema. Their patients range from premature infants with undeveloped lungs to elderly patients who have diseased lungs. They also provide emergency care to patients suffering from heart attacks, drowning, or shock.","id":"ckc.US.base-4.02-18","soc":"29-1126.00","name":"Respiratory Therapist"},{"en":"Speech-language pathologists (sometimes called speech therapists) assess, diagnose, treat, and help to prevent communication and swallowing disorders in children and adults. Speech, language, and swallowing disorders result from a variety of causes, such as a stroke, brain injury, hearing loss, developmental delay, Parkinson’s disease, a cleft palate, or autism.","id":"ckc.US.base-4.02-19","soc":"29-1127.00","name":"Speech-Language Pathologist"},{"en":"Dental hygienists clean teeth, examine patients for signs of oral diseases such as gingivitis, and provide other preventive dental care. They also educate patients on ways to improve and maintain good oral health.","id":"ckc.US.base-4.02-2","soc":"29-2021.00","name":"Dental Hygienist"},{"en":"Dietitians and nutritionists are experts in the use of food and nutrition to promote health and manage disease. They advise people on what to eat in order to lead a healthy lifestyle or achieve a specific health-related goal.","id":"ckc.US.base-4.02-3","soc":"29-2051.00","name":"Dietitian or Nutritionist"},{"en":"Exercise physiologists develop fitness and exercise programs that help patients recover from chronic diseases and improve cardiovascular function, body composition, and flexibility.","id":"ckc.US.base-4.02-4","soc":"29-1128.00","name":"Exercise Physiologist"},{"en":"Massage therapists treat clients by using touch to manipulate the muscles and other soft tissues of the body. With their touch, they relieve pain, help heal injuries, improve circulation, relieve stress, increase relaxation, and aid in the general wellness of clients.","id":"ckc.US.base-4.02-5","soc":"31-9011.00","name":"Massage Therapist"},{"en":"Nurse anesthetists (CRNAs) provide anesthesia and related care before, during, and after surgical, therapeutic, diagnostic, and obstetrical procedures. They also provide pain management and some emergency services.","id":"ckc.US.base-4.02-6","soc":"29-1151.00","name":"Nurse Anesthetist"},{"en":"Nurse practitioners (NPs) serve as primary and specialty care providers, delivering advanced nursing services to patients and their families. They assess patients, determine the best way to improve or manage a patient’s health, and discuss ways to integrate health promotion strategies into a patient’s life. They typically care for a certain population of people, focusing on adult and geriatric health, pediatric health, or psychiatric and mental health.","id":"ckc.US.base-4.02-7","soc":"29-1171.00","name":"Nurse Practitioner"},{"en":"Occupational therapists treat injured, ill, or disabled patients through the therapeutic use of everyday activities. They help these patients develop, recover, improve, and maintain skills needed for daily living and working.","id":"ckc.US.base-4.02-8","soc":"29-1122.00","name":"Occupational Therapist"},{"en":"Occupational therapy assistants and aides help patients develop, recover, improve, and maintain skills needed for daily living and working. Assistants are directly involved in providing therapy to patients; Aides typically perform support activities. Both work under the direction of occupational therapists.","id":"ckc.US.base-4.02-9","soc":"31-2011.00","name":"Occupational Therapy Assistant"},{"en":"Childcare workers attend to the basic needs of children, such as dressing, bathing, feeding, and overseeing play. They may help younger children prepare for kindergarten or assist older children with homework.","id":"ckc.US.base-4.03-1","soc":"39-9011.00","name":"Child Care Worker"},{"en":"Dental assistants perform a variety of tasks, from patient care and taking x rays to recordkeeping and scheduling appointments. Working under the direction of a dentist, some perform lab tasks, such as taking impressions of a patient’s teeth. They may prepare materials for dental impressions or to create temporary crowns.","id":"ckc.US.base-4.03-2","soc":"31-9091.00","name":"Dental Assistant"},{"en":"Home health aides help people with disabilities, chronic illnesses, or cognitive impairment by assisting in their daily living activities. They often help older adults who need assistance. In some states, they may be able to give a client medication or check the client’s vital signs under the direction of a nurse or other healthcare practitioner.","id":"ckc.US.base-4.03-3","soc":"31-1011.00","name":"Home Health Aide"},{"en":"Licensed practical nurses (LPNs) and licensed vocational nurses (LVNs) provide basic medical care. They work under the direction of registered nurses and doctors. Their duties vary state by state and work setting. For example, they may teach family members about how to care for a relative; help to deliver, care for, and feed infants; collect samples for testing and do routine laboratory tests; or feed patients who need help eating.","id":"ckc.US.base-4.03-4","soc":"29-2061.00","name":"Licensed Practical or Vocational Nurse"},{"en":"Medical assistants complete administrative and clinical tasks in the offices of physicians, hospitals, and other healthcare facilities.  Electronic health records (EHRs) are changing some medical assistants’ jobs, requiring them to learn new sofware systems.","id":"ckc.US.base-4.03-5","soc":"31-9092.00","name":"Medical Assistant"},{"en":"Nursing assistants, sometimes called nursing aides, help provide basic care for patients in hospitals and residents of long-term care facilities like nursing homes. Orderlies transport patients and clean treatment areas.","id":"ckc.US.base-4.03-6","soc":"31-1014.00","name":"Nursing Assistant"},{"en":"Personal care aides help people with disabilities, chronic illnesses, or cognitive impairment by assisting in their daily living activities. They often help older adults who need assistance. In some states, aides may be able to give a client medication or check the client’s vital signs under the direction of a nurse or other healthcare practitioner.","id":"ckc.US.base-4.03-7","soc":"39-9021.00","name":"Personal Care Aide"},{"en":"Social and human service assistants provide client services, including support for families, in a wide variety of fields, such as psychology, rehabilitation, and social work. They assist other workers like social workers, and they help clients find benefits or community services.","id":"ckc.US.base-4.03-8","soc":"21-1093.00","name":"Social & Human Service Assistant"},{"en":"Adult literacy and high school equivalency diploma teachers instruct adults in basic skills like reading, writing, and speaking English and help students earn their high school equivalent diploma. They often teach students of various education levels. As a result, they need to use different teaching strategies and methods that meet all students’ needs. They may work with students in classes or teach them one-on-one.","id":"ckc.US.base-4.04-1","soc":"25-3011.00","name":"Adult Literacy and High School Diploma Equivalency Teacher"},{"en":"Librarians help people find information and conduct research for personal and professional use. Their job duties may change based on the type of library they work in, such as public, academic, and medical libraries.","id":"ckc.US.base-4.04-10","soc":"25-4021.00","name":"Librarian"},{"en":"Library technicians and assistants help librarians with all aspects of running a library. They usually help patrons find information and organize library materials. However, technicians typically have more responsibilities than assistants like administering library programs and overseeing lower level staff.","id":"ckc.US.base-4.04-11","soc":"25-4031.00","name":"Library Technician or Assistant"},{"en":"Middle school teachers educate students, typically in sixth through eighth grade. They help students build on the fundamentals taught in elementary school and prepare students for the more difficult curriculum they will face in high school.","id":"ckc.US.base-4.04-12","soc":"25-2022.00","name":"Middle School Teacher"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses related to nursing. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-4.04-13","soc":"25-1072.00","name":"Nursing Instructor or Teacher"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses related to philosophy. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-4.04-14","soc":"25-1126.00","name":"Philosophy or Religion Teacher, Postsecondary"},{"en":"Preschool teachers educate and care for children younger than age 5 who have not yet entered kindergarten. They teach language, motor, and social skills to young children.","id":"ckc.US.base-4.04-15","soc":"25-2011.00","name":"Preschool Teacher"},{"en":"Special education teachers work with students who have a wide range of learning, mental, emotional, and physical disabilities. They adapt general education lessons and teach various subjects, such as reading, writing, and math, to students with mild and moderate disabilities. They also teach basic skills, such as literacy and communication techniques, to students with severe disabilities.","id":"ckc.US.base-4.04-16","soc":"25-2053.00","name":"Special Education Teacher"},{"en":"Teacher assistants work with or under the guidance of a licensed teacher. Generally, teachers introduce new material to students while teacher assistants help reinforce the lessons by working with individual students or small groups of students. For example, after the teacher presents a lesson, a teacher assistant may help a small group of students as they try to master the material.","id":"ckc.US.base-4.04-17","soc":"25-9041.00","name":"Teacher Assistant"},{"en":"Postsecondary teachers instruct students in a wide variety of academic and career and technical subjects beyond the high school level. They may also conduct research and publish scholarly papers and books.","id":"ckc.US.base-4.04-18","soc":"25-1199.00","name":"Teacher, Postsecondary"},{"en":"These teachers help students explore and prepare to enter a specific occupation, in fields such as healthcare or information technology. They use a variety of teaching techniques to help students learn and develop skills related to a specific career or field of study. They demonstrate tasks, techniques, and tools used in an occupation. They may assign hands-on tasks, such as replacing brakes on cars, taking blood pressure, or recording vital signs.","id":"ckc.US.base-4.04-2","soc":"25-1194.00","name":"Career and Technical Education Teacher"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses in a field of study or career and technical area. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-4.04-3","soc":"25-1199.00","name":"College or Community College Teacher"},{"en":"These teachers in grades 5 through 7 or 8 help students learn and apply important concepts. Many use a hands-on approach to help students understand abstract concepts, solve problems, and develop critical-thinking skills. For example, they may demonstrate how to do a science experiment and then have the students conduct the experiment themselves. They may have students work together to solve problems.","id":"ckc.US.base-4.04-4","soc":"25-2021.00","name":"Elementary School Teacher"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses related to health specialties like nursing, physical therapy, or rehabilitation. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-4.04-5","soc":"25-1071.00","name":"Health Specialties Teacher, Postsecondary"},{"en":"High school teachers generally teach students from the 9th through 12th grades. They usually specialize in one subject area, such as math, science, or history. They may teach several different classes within that subject area. For example, a high school math teacher may teach courses in algebra, calculus, and/or geometry.","id":"ckc.US.base-4.04-6","soc":"25-2031.00","name":"High School Teacher"},{"en":"Instructional coordinators, also known as curriculum specialists, evaluate the effectiveness of curriculums and teaching techniques established by school boards, states, or federal regulations. They may observe teachers in the classroom, review student test data, and interview school staff about curriculums.They may conduct training for teachers related to teaching methods or the use of technology.","id":"ckc.US.base-4.04-7","soc":"25-9031.00","name":"Instructional Coordinator"},{"en":"Kindergarten teachers help students learn and apply important concepts. Many use a hands-on approach to help students understand abstract concepts, solve problems, and develop critical-thinking skills. They typically instruct students in several subjects throughout the day. They may escort students to assemblies, recess, or classes taught by other teachers, such as art or music.","id":"ckc.US.base-4.04-8","soc":"25-2012.00","name":"Kindergarten Teacher"},{"en":"These teachers, also called faculty or professors, specialize in teaching a variety of courses related to law. They may also conduct research, publish their findings, apply for grants to receive research funding, or supervise graduate students. Their duties vary depending on the size of the institution where they teach, and whether they have \"tenure\" - meaning they cannot be fired without just cause.","id":"ckc.US.base-4.04-9","soc":"25-1112.00","name":"Law Teacher, Postsecondary"},{"en":"Coaches teach professional and amateur athletes fundamental skills of individual and team sports. They hold training sessions to improve athletes’ form, technique, skills, and stamina. Along with refining athletes’ individual skills, coaches teach players the importance of good sportsmanship, a competitive spirit, and teamwork. Scouts look for new players, evaluating their skills and likelihood for success at the college, amateur, or professional level.","id":"ckc.US.base-4.05-1","soc":"27-2022.00","name":"Coach or Scout"},{"en":"Fitness trainers and instructors lead, instruct, and motivate individuals or groups in exercise activities, including cardiovascular exercises (exercises for the heart and blood circulation), strength training, and stretching. They work with people of all ages and skill levels.","id":"ckc.US.base-4.05-2","soc":"39-9031.00","name":"Fitness Trainer or Aerobics Instructor"},{"en":"Recreation workers design and lead activities to help people stay active, improve fitness, and have fun. They work with groups in summer camps, fitness and recreational sports centers, nursing care facilities, nature parks, and other settings. They may lead activities in arts and crafts, sports, music, dramatics, or games.","id":"ckc.US.base-4.05-3","soc":"39-9032.00","name":"Recreation Worker"},{"en":"Umpires, referees, and other sports officials preside over competitive athletic or sporting events to help maintain standards of play. They detect infractions and decide penalties according to the rules of the game. Regardless of the sport, the job is highly stressful because officials often must make split-second rulings. These rulings sometimes result in strong disagreement expressed by players, coaches, and spectators.","id":"ckc.US.base-4.05-4","soc":"27-2023.00","name":"Sports Official, Umpire, or Referee"},{"en":"These agents commonly sell one or more types of insurance: property and casualty, life, health, and long-term care insurance. Property/casualty policies protect people and businesses from financial loss resulting from automobile accidents, fire, theft, and other events that damage property. Life insurance policies pay beneficiaries when a policyholder dies. Health and long-term care policies cover costs of medical care and assisted-living services for senior citizens.","id":"ckc.US.base-5.01-1","soc":"41-3021.00","name":"Insurance Sales Agent"},{"en":"Buyers and purchasing agents buy farm products, durable and nondurable goods, and services for organizations and institutions. They try to get the best deal for their organization: the highest quality goods and services at the lowest cost. They do this by studying sales records and inventory levels of current stock, identifying foreign and domestic suppliers, and keeping up to date with changes affecting both the supply of, and demand for, products and materials.","id":"ckc.US.base-5.01-2","soc":"13-1021.00","name":"Purchasing Agent or Buyer"},{"en":"Real estate brokers and sales agents help clients buy, sell, and rent properties. Although brokers and agents do similar work, brokers are licensed to manage their own real estate businesses. Sales agents must work with a real estate broker.","id":"ckc.US.base-5.01-3","soc":"41-9022.00","name":"Real Estate Sales Agent"},{"en":"Retail salespersons work in stores where they sell goods, such as books, cars, clothing, cosmetics, electronics, furniture, lumber, plants, shoes, and many other types of merchandise. In addition to helping customers find and select items to buy, many salespersons process the payment for the sale, which typically involves operating cash registers.","id":"ckc.US.base-5.01-4","soc":"41-2031.00","name":"Retail Salesperson"},{"en":"Financial services sales agents consult on a wide variety of banking, securities, insurance, and related services to individuals and businesses, often catering the services to meet the client’s financial needs. They contact potential clients to explain their services, which may include the handling of checking accounts, loans, certificates of deposit, individual retirement accounts, credit cards, and estate and retirement planning.","id":"ckc.US.base-5.01-5","soc":"41-3031.02","name":"Sales Agent, Financial Services"},{"en":"Brokers sell securities and commodities directly to individual clients, advising based on client needs and financial ability. Clients may have very different levels of expertise in financial matters. Investment bankers connect businesses that need money to finance their operations or expansion plans with investors who are interested in providing that funding. This process is called underwriting, and it is the main function of investment banks.","id":"ckc.US.base-5.01-6","soc":"41-3031.01","name":"Sales Agent, Securities and Commodities"},{"en":"Sales engineers sell complex scientific and technological products or services to businesses. They must have extensive knowledge of the products’ parts and functions and must understand the scientific processes that make these products work.","id":"ckc.US.base-5.01-7","soc":"41-9031.00","name":"Sales Engineer"},{"en":"Wholesale and manufacturing sales representatives sell goods for wholesalers or manufacturers to businesses, government agencies, and other organizations. They contact customers, explain the features of the products they are selling, negotiate prices, and answer any questions that their customers may have about the products.","id":"ckc.US.base-5.01-8","soc":"41-4012.00","name":"Sales Representative, Wholesale & Manufacturing"},{"en":"Wholesale and retail buyers purchase goods for resale to consumers like clothing and electronics. Purchasing specialists who buy finished goods for resale are commonly known as buyers or merchandise managers.","id":"ckc.US.base-5.01-9","soc":"13-1022.00","name":"Wholesale or Retail Buyer"},{"en":"Barbers cut, trim, shampoo, and style hair, mostly for male clients. They also may fit hairpieces, perform facials, and offer facial shaving. Depending on their state, some barbers are licensed to color, bleach, and highlight hair and to offer permanent-wave services.","id":"ckc.US.base-5.02-1","soc":"39-5011.00","name":"Barber"},{"en":"Bartenders mix drinks and serve them directly to customers or through wait staff. Some work in this job to make money to support themselves during school or pursuing lesser paying professions. Hours are typically long during evenings and weekends.","id":"ckc.US.base-5.02-2","soc":"35-3011.00","name":"Bartender"},{"en":"The primary job of flight attendants is to keep airline passengers safe, ensuring that everyone follows security regulations and that the flight deck is secure.They also try to make flights comfortable and stress free for passengers. At times, they may deal with passengers who display disruptive behavior.","id":"ckc.US.base-5.02-3","soc":"53-2031.00","name":"Flight Attendant"},{"en":"Gaming services workers serve customers in gambling establishments, such as casinos or racetracks. Some workers tend slot machines or deal cards. Others take bets or pay out winnings. Some supervise or manage gaming workers and operations.","id":"ckc.US.base-5.02-4","soc":"39-3019.00","name":"Gaming Service Worker"},{"en":"Hairstylists offer a wide range of hair services, such as shampooing, cutting, coloring, and styling. They often advise male and female clients on how to care for their hair at home. Hairstylists also keep records of products and services provided to clients, such as hair color, shampoo, conditioner, and hair treatment used. Cosmetologists provide scalp and facial treatments and makeup analysis.","id":"ckc.US.base-5.02-5","soc":"39-5012.00","name":"Hairdresser, Hairstylist, or Cosmetologist"},{"en":"Manicurists and pedicurists clean, shape, and beautify fingernails and toenails. Some operate their own nail salon, which requires performing business tasks such as keeping inventory records and ordering supplies.","id":"ckc.US.base-5.02-6","soc":"39-5092.00","name":"Manicurist and Pedicurist"},{"en":"Skincare specialists give facials, full-body treatments, and head and neck massages to improve the health and appearance of the skin. Some may provide other skin care treatments, such as peels, masks, and scrubs, to remove dead or dry skin.","id":"ckc.US.base-5.02-7","soc":"39-5094.00","name":"Skincare Specialist"},{"en":"Travel agents sell transportation, lodging, and admission to entertainment activities to individuals and groups planning trips. They offer advice on destinations, plan trip itineraries, and make travel arrangements for clients.","id":"ckc.US.base-5.02-8","soc":"41-3041.00","name":"Travel Agent"},{"en":"Waiters and waitresses, also called servers, are responsible for ensuring that customers have a satisfying dining experience. The specific duties of servers vary with the establishment in which they work.","id":"ckc.US.base-5.02-9","soc":"35-3031.00","name":"Waiter/Waitress"},{"en":"Administrative law judges, adjudicators, and hearing officers usually work for local, state, and federal government agencies. They decide many issues, such as whether a person is eligible for workers’ compensation benefits or whether employment discrimination occurred.","id":"ckc.US.base-5.03-1","soc":"23-1021.00","name":"Administrative Law Judge/ Hearing Officer"},{"en":"Arbitrators, mediators, and conciliators help opposing parties settle disputes outside of court. They hold private, confidential hearings, which are less formal than a court trial.","id":"ckc.US.base-5.03-2","soc":"23-1022.00","name":"Arbitrator, Mediator, or Conciliator"},{"en":"Judges, magistrate judges, and magistrates preside over trials and hearings. They typically work in local, state, and federal courts. In local courts, they're called municipal court judge, county court judge, and justice of the peace. Traffic violations, misdemeanors, small-claims cases, and pretrial hearings make up most of the judges’ work. In federal and state courts, district court judges and general trial court judges have authority over any case in their system.","id":"ckc.US.base-5.03-3","soc":"23-1023.00","name":"Judge"},{"en":"Lawyers, also called attorneys, act as both advocates and advisors to individuals, businesses, and government agencies on legal issues and disputes. As advocates, they represent one of the parties in a criminal or civil trial by presenting evidence and arguing in support of their client. As advisors, they counsel their clients about their legal rights and obligations and suggest courses of action in business and personal matters.","id":"ckc.US.base-5.03-4","soc":"23-1011.00","name":"Lawyer"},{"en":"Paralegals and legal assistants perform a variety of tasks to support lawyers, including maintaining and organizing files, conducting legal research, and drafting documents. In addition to litigation and corporations, they may also specialize in other legal areas, like personal injury, criminal law, employee benefits, intellectual property, bankruptcy, immigration, family law, and real estate.","id":"ckc.US.base-5.03-5","soc":"23-2011.00","name":"Paralegal/Legal Assistant"},{"en":"Administrative services managers plan, direct, and coordinate supportive services of an organization. Their specific responsibilities vary, but they typically maintain facilities and supervise activities that include recordkeeping, mail distribution, and office upkeep. In a small organization, they may direct all support services and may be called the business office manager.","id":"ckc.US.base-5.04-1","soc":"11-3011.00","name":"Administrative Services Manager"},{"en":"These managers use their knowledge of engineering to oversee a variety of activities in organizations providing professional engineering services. They may direct and coordinate building activities at construction sites or activities related to production, operations, quality assurance, testing, or maintenance at manufacturing sites.","id":"ckc.US.base-5.04-10","soc":"11-9041.00","name":"Engineering Manager"},{"en":"These managers take care of the day-to-day operations of one or more farms, ranches, nurseries, timber tracts, greenhouses, and other agricultural establishments for corporations, farmers, and owners who do not live and work on their farm or ranch.","id":"ckc.US.base-5.04-11","soc":"11-9013.00","name":"Farm, Ranch, or Other Agricultural Manager"},{"en":"These managers are responsible for the daily operation of restaurants or other establishments that prepare and serve food and beverages. They direct staff to ensure that customers are satisfied with their dining experience, and they manage the business to ensure that it is profitable.","id":"ckc.US.base-5.04-12","soc":"11-9051.00","name":"Food Services Manager"},{"en":"Funeral directors and morticians plan the details of a funeral. They often prepare obituary notices and arrange for pallbearers and clergy services. If a burial is chosen, they schedule the opening and closing of a grave with a representative of the cemetery. If cremation is chosen, they coordinate the process with the crematory. They also prepare the sites of all services and provide transportation for the deceased and mourners.","id":"ckc.US.base-5.04-13","soc":"39-4031.00","name":"Funeral Director"},{"en":"Gaming managers and supervisors direct and oversee the gaming operations and personnel in their assigned area. Supervisors circulate among the tables to make sure that everything is running smoothly and that all areas are properly staffed. They handle customer complaints as well as answer questions about and explain rules and regulations.","id":"ckc.US.base-5.04-14","soc":"11-9071.00","name":"Gaming Manager or Supervisor"},{"en":"These managers oversee operations that are too diverse and general to be classified into one area of management or administration. Responsibilities may include formulating policies, managing daily operations, and planning the use of materials and human resources.","id":"ckc.US.base-5.04-15","soc":"11-1021.00","name":"General and Operations Manager"},{"en":"Human resources generalists handle all aspects of human resources work. They may have duties in all areas of human resources including recruitment, employee relations, compensation, benefits, training, as well as the administration of human resources policies, procedures, and programs.","id":"ckc.US.base-5.04-16","soc":"13-1071.00","name":"Human Resources Specialist"},{"en":"Also called plant managers, they may oversee an entire manufacturing plant or a specific area of production. They are responsible for carrying out quality control programs to make sure the finished product meets a specific level of quality. Often called quality control systems managers, these managers use programs to help identify defects in products, identify the cause of the defect, and solve the problem creating it.","id":"ckc.US.base-5.04-17","soc":"11-3051.00","name":"Industrial Production Manager"},{"en":"These employees  administer labor contracts that cover issues such as grievances, wages, benefits, and union and management practices. They also handle labor complaints between employees and management, following grievance procedures. They help managers prepare for negotiations when a labor contract expires.","id":"ckc.US.base-5.04-18","soc":"13-1075.00","name":"Labor Relations Specialist"},{"en":"Lodging managers ensure that guests on vacation or business travel have a pleasant experience at a hotel, motel, or other types of establishments with accommodations.They also ensure that the establishment is run efficiently and profitably.","id":"ckc.US.base-5.04-19","soc":"11-9081.00","name":"Lodging Manager (e.g., Hotel, Motel, Resort)"},{"en":"These managers represent the best interests of artists, performers and athletes in communicating with prospective or current sponsors, employers and organizations. They may help negotiate contracts, schedule performances and make other arrangements on behalf of their clients.","id":"ckc.US.base-5.04-2","soc":"13-1011.00","name":"Agent and Business Manager of Artists, Performers, and Athletes"},{"en":"Logisticians analyze and coordinate an organization’s supply chain—the system that moves a product from supplier to consumer. They manage the entire life cycle of a product, which includes how a product is acquired, allocated, and delivered.","id":"ckc.US.base-5.04-20","soc":"13-1081.00","name":"Logistician"},{"en":"Medical and health services managers, also called healthcare executives or healthcare administrators, plan, direct, and coordinate medical and health services. They may manage an entire facility, a specific clinical area or department, or a medical practice for a group of physicians. Examples: nursing home administrator, clinical manager, health information manager.","id":"ckc.US.base-5.04-21","soc":"11-9111.00","name":"Medical and Health Services Manager"},{"en":"Meeting, convention, and event planners organize a variety of events, including weddings, educational conferences, and business conventions. They coordinate every detail of these events, including finances. They may also search for potential meeting sites, such as hotels and convention centers.","id":"ckc.US.base-5.04-22","soc":"13-1121.00","name":"Meeting, Convention, and Event Planner"},{"en":"Natural sciences managers direct scientific research activities and coordinate product development projects and production activities. Their duties vary with the field of science (such as biology or chemistry) or the industry they work in. Research projects may be aimed at improving manufacturing processes, advancing basic scientific knowledge, or developing new products.","id":"ckc.US.base-5.04-23","soc":"11-9121.00","name":"Natural Science Manager"},{"en":"Preschool and childcare center directors supervise and lead staffs, design program plans, oversee daily activities, and prepare budgets. Some centers are independently owned and operated. In these facilities, directors must follow the instructions and guidelines of the owner. Sometimes the directors are the owners.","id":"ckc.US.base-5.04-24","soc":"11-9031.00","name":"Preschool and Childcare Center Director"},{"en":"Producers make the business and financial decisions for a motion picture, TV show, commercial, or stage production. They raise money for the project and hire the director and crew. Directors are responsible for the creative decisions of a production. They select cast members, conduct rehearsals, and direct the work of the cast and crew. Although they are in charge of the creative aspects of a show, they ultimately answer to producers.","id":"ckc.US.base-5.04-25","soc":"27-2012.00","name":"Producer or Director (TV/radio, movies, theater)"},{"en":"Property and real estate managers oversee the operation of income-producing commercial or residential properties and ensure that real estate investments achieve their expected revenues. They handle the financial operations of the property, making certain that rent is collected and that mortgages, taxes, insurance premiums, payroll, and maintenance bills are paid on time.","id":"ckc.US.base-5.04-26","soc":"11-9141.00","name":"Property or Real Estate Manager"},{"en":"These managers are responsible for developing their organization’s procurement policies and procedures. These policies help ensure that procurement professionals are meeting ethical standards to avoid potential conflicts of interest or inappropriate supplier and customer relations. They oversee buyers and purchasing agents buying products and services for organizations to use or resell.","id":"ckc.US.base-5.04-27","soc":"11-3061.00","name":"Purchasing Manager"},{"en":"These managers coordinate and supervise social service programs and community organizations, managing employees who provide social services to the public. They are often expected to show that their programs and services are effective. To do that, they collect statistics and other information to evaluate the impact their programs have on the community or their target audience then provide it to administrators or funders.","id":"ckc.US.base-5.04-28","soc":"11-9151.00","name":"Social and Community Service Manager"},{"en":"These directors coordinate technical departments such as engineering, taping and maintenance to produce television and radio shows. They work with broadcast technicians, sound engineers and other supporting technical staff to produce programs.","id":"ckc.US.base-5.04-29","soc":"27-2012.05","name":"Technical Director/Manager (TV/radio, movies, theater)"},{"en":"These managers take care of the day-to-day operations of farms, ranches, nurseries, timber tracts, greenhouses, and other agricultural establishments for corporations, farmers, and owners who do not live and work on their farm or ranch.","id":"ckc.US.base-5.04-3","soc":"11-9013.00","name":"Agricultural Manager"},{"en":"These managers oversee training programs, staff, and budgets. They are responsible for creating or selecting course content and materials for training programs. Training may be online, delivered in-person, and/or collaborative with employees informally connecting with experts, mentors, and colleagues. They must ensure that training methods, content, software, systems, and equipment are appropriate and meaningful.","id":"ckc.US.base-5.04-30","soc":"11-3131.00","name":"Training and Development Manager"},{"en":"Training and development specialists help create, administer, and deliver training programs for businesses and organizations. To do this, they must first assess the needs of an organization, and then develop custom training programs that take place in classrooms or training facilities.","id":"ckc.US.base-5.04-31","soc":"13-1151.00","name":"Training and Development Specialist"},{"en":"Sometimes called executive chefs, they are responsible for overseeing the operation of a kitchen. They coordinate the work of sous chefs and other cooks, who prepare most of the meals. They also have many duties beyond the kitchen. They design the menu, review food and beverage purchases, and often train cooks and other food preparation workers.","id":"ckc.US.base-5.04-4","soc":"35-1011.00","name":"Chef/Head Cook"},{"en":"Chief executive officers (CEOs), who are also known as executive director, managing director, or president, provide overall direction for companies and organizations. CEOs manage company operations, formulate and implement policies, and ensure goals are met. They collaborate with and direct the work of other top executives and typically report to a board of directors.","id":"ckc.US.base-5.04-5","soc":"11-1011.00","name":"Chief Executive Officer"},{"en":"Although some managers administer both the compensation and benefits programs in an organization, other managers—particularly at large organizations—specialize and oversee one or the other. All routinely meet with senior staff, human resources managers, and financial officers. They provide expertise and make recommendations on compensation and benefits policies, programs, and plans.","id":"ckc.US.base-5.04-6","soc":"11-3111.00","name":"Compensation & Benefits Manager"},{"en":"Theses managers, often called information technology (IT) managers or IT project managers, plan, coordinate, and direct computer-related activities in an organization. They help determine the information technology goals of an organization and are responsible for implementing computer systems to meet those goals. Examples: Chief Information Officer, Chief Technology Officer, and IT Security Manager.","id":"ckc.US.base-5.04-7","soc":"11-3021.00","name":"Computer and Information System Manager"},{"en":"These managers, often called general contractors or project managers, coordinate and supervise a wide variety of construction projects, including the building of all types of public, residential, commercial, and industrial structures, as well as roads, memorials, and bridges. They may also consult with the client during the design phase to help refine construction plans and control costs.","id":"ckc.US.base-5.04-8","soc":"11-9021.00","name":"Construction Manager"},{"en":"Recruitment specialists, sometimes known as personnel recruiters or “head hunters,” find, screen, and interview applicants for job openings in an organization. They search for applicants by posting listings, attending job fairs, and visiting college campuses. They also may test applicants, contact references, and extend job offers.","id":"ckc.US.base-5.04-9","soc":"13-1071.00","name":"Employment, Recruitment and Placement Specialist"},{"en":"Accountants and auditors prepare and examine financial records. They ensure financial records are accurate and that taxes are paid properly and on time.They assess financial operations and help ensure organizations run efficiently. Some work for organizations specializing in assurance services (improving the quality or context of information for decisionmakers) or risk management (determining the probability of a misstatement on financial documentation).","id":"ckc.US.base-5.05-1","soc":"13-2011.01","name":"Accountant or Auditor"},{"en":"Appraisers and assessors of real estate provide a value estimate on land and buildings usually before they are sold, mortgaged, taxed, insured, or developed. They work in locations with which they are familiar so they know of any environmental or other concerns that may affect the property's value.","id":"ckc.US.base-5.05-2","soc":"13-2021.02","name":"Appraiser, Real Estate"},{"en":"Treasurers and finance officers direct their organization’s budgets to meet its financial goals. They oversee the investment of funds and carry out strategies to raise capital (such as issuing stocks or bonds) to support the firm’s expansion. They also develop financial plans for mergers (two companies joining together) and acquisitions (one company buying another).","id":"ckc.US.base-5.05-3","soc":"11-1011.00","name":"Chief Financial Officer"},{"en":"Financial managers are responsible for the financial health of an organization. They produce financial reports, direct investment activities, and develop strategies and plans for the long-term financial goals of their organization.","id":"ckc.US.base-5.05-4","soc":"11-3031.00","name":"Financial Manager"},{"en":"Loan officers use a process called underwriting to assess whether applicants qualify for loans. After collecting and verifying all the required financial documents, they evaluate the information they obtain to determine the applicant’s need for a loan and ability to pay back the loan. Their job includes customer-service and sales, including answering questions and guiding customers through the application process.","id":"ckc.US.base-5.05-5","soc":"13-2072.00","name":"Loan Officer"},{"en":"These advisors assess individuals' financial needs of individuals and help them with decisions on investments (such as stocks and bonds), tax laws, and insurance. They help clients plan for short- and long-term goals, such as meeting education expenses and saving for retirement through investments. They invest clients’ money based on the clients’ decisions. Many advisors also provide tax advice or sell insurance.","id":"ckc.US.base-5.05-6","soc":"13-2052.00","name":"Personal Financial Advisor"},{"en":"Treasurers direct their organization’s budgets to meet its financial goals. Controllers direct the preparation of financial reports that summarize and forecast the organization’s financial position, such as income statements, balance sheets, and analyses of future earnings or expenses. They also are in charge of preparing special reports for governmental agencies regulating businesses. Often, they oversee the accounting, audit, and budget departments.","id":"ckc.US.base-5.05-7","soc":"11-3031.01","name":"Treasurer or Controller"},{"en":"Archivists preserve important or historically significant documents and records. They coordinate educational and public outreach programs, such as tours, workshops, lectures, and classes. They also may work with researchers on topics and items relevant to their collections. Some specialize in a historical era so they can have a better understanding of the records from that era.","id":"ckc.US.base-5.06-1","soc":"25-4011.00","name":"Archivist"},{"en":"Curators, also known as museum directors, lead the acquisition, storage, and exhibition of collections. They negotiate and authorize the purchase, sale, exchange, and loan of collections. They also may research, authenticate, evaluate, and categorize the specimens in a collection.","id":"ckc.US.base-5.06-2","soc":"25-4012.00","name":"Curator"},{"en":"Postsecondary education administrators oversee student services, academics, and faculty research at colleges and universities. Their job duties vary depending on the area of the college they manage, such as admissions, student affairs, or the registrar’s office.","id":"ckc.US.base-5.06-3","soc":"11-9033.00","name":"Education Administrator (Postsecondary)"},{"en":"Emergency management directors prepare plans and procedures for responding to natural disasters and other emergencies. They also help lead the response during and after emergencies, often in coordination with public safety officials, elected officials, nonprofit organizations, and government agencies.","id":"ckc.US.base-5.06-4","soc":"11-9161.00","name":"Emergency Management Director"},{"en":"Mayors, along with governors, city managers, and county administrators, are chief executive officers of governments. They typically oversee budgets, programs, and the use of resources. Mayors and governors must be elected to office, while managers and administrators are typically appointed. School superintendents and college or university presidents are chief executive officers of school districts and postsecondary schools.","id":"ckc.US.base-5.06-5","soc":"11-1011.00","name":"Government Service Executive"},{"en":"Legislators are elected officials representing the interests of their constituents (who elected them) at the state or federal government levels. Depending on their office, they may serve part-time or full-time, meeting with the legislators from other geographic districts. In collaboration with others, they make laws and oversee the functions of government on behalf of the people they represent.","id":"ckc.US.base-5.06-6","soc":"11-1031.00","name":"Legislator"},{"en":"Elementary, middle, and high school principals direct the overall operation of schools. They set and oversee academic goals and ensure that teachers have the equipment and resources to meet those goals. They may establish and supervise additional programs in their school, such as counseling, extracurricular activities, and before- and after-school childcare.","id":"ckc.US.base-5.06-7","soc":"11-9032.00","name":"School Principal"},{"en":"Advertising managers create interest among potential buyers of a product or service. They do this for a department, for an entire organization, or on a project basis (referred to as an account). Promotions managers direct programs that combine advertising with purchasing incentives to increase sales.","id":"ckc.US.base-5.07-1","soc":"11-2011.00","name":"Advertising and Promotions Manager"},{"en":"Also called advertising sales representatives, they sell advertising space to businesses and individuals. They contact potential clients, make sales presentations, and maintain client accounts.","id":"ckc.US.base-5.07-2","soc":"41-3011.00","name":"Advertising Sales Agent"},{"en":"Copywriters prepare advertisements to promote the sale of a good or service. They often work with a client to produce written content, such as advertising themes, jingles, and slogans.","id":"ckc.US.base-5.07-3","soc":"27-3043.04","name":"Copy Writer"},{"en":"Marketing managers estimate the demand for products and services that an organization and its competitors offer. They identify potential markets for the organization’s products. They also develop pricing strategies to help organizations maximize their profits and market share while ensuring that the organizations’ customers are satisfied.","id":"ckc.US.base-5.07-4","soc":"11-2021.00","name":"Marketing Manager"},{"en":"Public relations managers plan and direct the creation of material that will maintain or enhance the public image of their employer or client. They help clarify their organization’s point of view to its main audience through media releases and interviews. Observing social, economic, and political trends that might ultimately affect their organization, they recommend ways to enhance the firm’s image based on those trends.","id":"ckc.US.base-5.07-5","soc":"11-2031.00","name":"Public Relations Manager"},{"en":"These communications specialists and media specialists handle an organization’s communication with the public, including consumers, investors, reporters, and other media specialists. In government, they may be called press secretaries, who keep the public informed about the activities of government officials and agencies.","id":"ckc.US.base-5.07-6","soc":"27-3031.00","name":"Public Relations Specialist"},{"en":"Sales managers’ responsibilities vary with the size of their organizations. However, most sales managers direct the distribution of goods and services by assigning sales territories, setting sales goals, and establishing training programs for the organization’s sales representatives.","id":"ckc.US.base-5.07-7","soc":"11-2022.00","name":"Sales Manager"},{"en":"Financial examiners ensure compliance with laws governing financial institutions and transactions. They review balance sheets, evaluate the risk level of loans, and assess bank management. Those working in risk assessment evaluate the health of financial institutions.  Those working in consumer compliance monitor lending activity to ensure that borrowers are treated fairly.","id":"ckc.US.base-5.08-1","soc":"13-2061.00","name":"Financial Examiner"},{"en":"These officers and inspectors enforce U.S. immigration and customs laws, checking documents, identifying people, and inspecting carriers like trucks and ships. These laws apply to people and goods entering and exiting the U.S. as well as between states.","id":"ckc.US.base-5.08-2","soc":"33-3021.05","name":"Immigration or Customs Inspector"},{"en":"Occupational health and safety specialists and technicians collect data on and analyze many types of work environments and work procedures. Specialists inspect workplaces for adherence to regulations on safety, health, and the environment. Technicians work with specialists in conducting tests and measuring hazards to help prevent harm to workers, property, the environment, and the general public.","id":"ckc.US.base-5.08-3","soc":"29-9011.00","name":"Occupational Health and Safety Specialist"},{"en":"These professionals determine how much is owed in taxes and collect tax from individuals and businesses on behalf of federal, state, and local governments. They review tax returns, conduct audits, identify taxes owed, and collect overdue tax payments.","id":"ckc.US.base-5.08-4","soc":"13-2081.00","name":"Tax Examiner, Collector, or Revenue Agent"},{"en":"Bill and account collectors try to recover payment on overdue bills. They negotiate repayment plans with debtors and help them find solutions to make paying their overdue bills easier.","id":"ckc.US.base-6.01-1","soc":"43-3011.00","name":"Bill and Account Collector"},{"en":"These clerks calculate charges, generate bills, and prepare them to be mailed to customers. They review documents like purchase orders, sales tickets, charge slips, and hospital records to compute fees or charges due. They also contact customers to get or give account information.","id":"ckc.US.base-6.01-2","soc":"43-3021.02","name":"Billing, Cost, or Rate Clerk"},{"en":"Bookkeeping clerks, also known as bookkeepers, often are responsible for some or all of an organization’s accounts, known as the general ledger. Accounting clerks typically work for larger companies and have more specialized tasks. Their titles, such as accounts payable clerk or accounts receivable clerk, often reflect the type of accounting they do. Auditing clerks check figures, postings, and documents to ensure that they are mathematically accurate and properly coded.","id":"ckc.US.base-6.01-3","soc":"43-3031.00","name":"Bookkeeping, Accounting or Auditing Clerk"},{"en":"Brokerage clerks help with tasks associated with securities such as stocks, bonds, commodities, and other kinds of investments. Their duties include writing orders for stock purchases and sales, computing transfer taxes, verifying stock transactions, accepting and delivering securities, distributing dividends, and keeping records of daily transactions and holdings.","id":"ckc.US.base-6.01-4","soc":"43-4011.00","name":"Brokerage Clerk"},{"en":"Insurance claim adjusters inspect property damage or personal injury claims to determine how much the insurance company should pay for the loss. Examiners review claims after submission to ensure proper guidelines were followed. Examiners who work in health insurance review health-related claims to see whether the costs are reasonable, given the diagnosis. After review, they authorize appropriate payment, deny the claim, or refer it to an investigator.","id":"ckc.US.base-6.01-5","soc":"13-1031.00","name":"Claims Adjuster, Examiner or Investigator"},{"en":"In construction, estimators prepare estimates for buildings, roads, and other construction projects. They may calculate the total cost of building a bridge or commercial shopping center, or they may calculate the cost of just one component, such as the foundation. In manufacturing, estimators calculate the costs of developing, producing, or redesigning a company’s goods or services.","id":"ckc.US.base-6.01-6","soc":"13-1051.00","name":"Cost Estimator"},{"en":"These securities and investment analysts evaluate investment opportunities on the buy-side or sell-side. They work in banks, pension funds, mutual funds, securities firms, insurance companies, and other businesses. They generally focus on trends affecting a specific industry, geographical region, or type of product. For example, an analyst may focus on a subject area such as the energy industry or a world region such as Eastern Europe.","id":"ckc.US.base-6.01-7","soc":"13-2051.00","name":"Financial Analyst"},{"en":"Underwriters are the main link between an insurance company and an insurance agent.They use computer software programs to determine whether to approve an applicant. They take specific information about a client and enter it into a program, which provides recommendations on coverage and premiums. After evaluating these recommendations, they decide whether to approve or reject the application.","id":"ckc.US.base-6.01-8","soc":"13-2053.00","name":"Insurance Underwriter"},{"en":"These clerks compile and post employee time and payroll data. They verify and record attendance, hours worked, and pay adjustments. They ensure that employees are paid on time and that their paychecks are accurate.","id":"ckc.US.base-6.01-9","soc":"43-3051.00","name":"Payroll or Timekeeping Clerk"},{"en":"Cashiers process payments from customers purchasing goods and services. Some employers require them to check the age of their customers when selling age-restricted products, such as alcohol and tobacco. Some may have duties not directly related to sales and customer service, such as mopping floors, taking out the trash, and other custodial tasks.","id":"ckc.US.base-6.02-1","soc":"41-2011.00","name":"Cashier"},{"en":"These customer service clerks greet people in person to process rentals and repairs, such as for cars. They may have sales duties and sales goals, informing customers about additional options and services available for purchase.","id":"ckc.US.base-6.02-2","soc":"41-2021.00","name":"Counter or Rental Clerk"},{"en":"Gaming cage workers work in casinos and other gaming establishments. The “cage” in which they work is the central depository for money and gaming chips. Gaming cage workers sell gambling chips, tokens, or tickets to patrons. They count funds and reconcile daily summaries of transactions in order to balance books.","id":"ckc.US.base-6.02-3","soc":"41-2012.00","name":"Gaming Cage Worker"},{"en":"Insurance claims and policy processing clerks process applications for insurance policies. They also handle customers’ requests to change or cancel their existing policies, interview clients and review insurance applications to ensure all questions are answered. They also notify insurance agents and accounting departments of policy cancellations or changes.","id":"ckc.US.base-6.02-4","soc":"43-9041.01","name":"Insurance Claim Clerk"},{"en":"These salespeople sell spare and replacement parts and equipment, especially car parts. Most work in either automotive parts stores or automobile dealerships. They take customers’ orders, inform customers of part availability and price, and take inventory.","id":"ckc.US.base-6.02-5","soc":"41-2022.00","name":"Parts Salesperson"},{"en":"These clerks sell stamps, money orders, postal stationery, mailing envelopes, and boxes in post offices throughout the country. They register, certify, and insure mail, calculate and collect postage, and answer questions about other postal matters. They also may help sort mail.","id":"ckc.US.base-6.02-6","soc":"43-5051.00","name":"Postal Service Clerk"},{"en":"Tellers are responsible for accurately processing routine transactions at a bank. These transactions include cashing checks, depositing money, and collecting loan payments.","id":"ckc.US.base-6.02-7","soc":"43-3071.00","name":"Teller"},{"en":"Controllers manage the flow of aircraft into and out of airport airspace, guide pilots during takeoff and landing, and monitor aircraft as they travel through the skies. They usually manage multiple aircraft at the same time and must make quick decisions to ensure the safety of aircraft using information from radar, computers, or visual references.","id":"ckc.US.base-6.03-1","soc":"53-2021.00","name":"Air Traffic Controller"},{"en":"Customer service representatives answer questions or requests from customers or the public. They typically provide services by phone, but some also interact with customers face to face, or by email or live chat.","id":"ckc.US.base-6.03-2","soc":"43-4051.00","name":"Customer Service Representative"},{"en":"Hotel, motel, and resort desk clerks, also called front desk clerks, provide customer service to guests at the establishment’s front desk. They check guests in and out, assign rooms, and process payments. They also answer phone calls, take and deliver messages for guests, and handle guests’ requests and complaints.","id":"ckc.US.base-6.03-3","soc":"43-4081.00","name":"Hotel, Motel, or Resort Desk Clerk"},{"en":"Loan interviewers, also called loan processors or loan clerks, interview applicants and others to get and verify personal and financial information needed to complete loan applications. They also prepare the documents that go to the appraiser and are issued at the closing of a loan.","id":"ckc.US.base-6.03-4","soc":"43-4131.00","name":"Loan Interviewer or Clerk"},{"en":"These public safety telecommunicators or communications officers answer calls from people who need help from police, firefighters, emergency services, or a combination of the three. They take emergency, nonemergency, and alarm system calls. They must stay calm while collecting vital information from callers to determine how severe their situation is and their location - then communicate it to the appropriate first-responder agencies.","id":"ckc.US.base-6.03-5","soc":"43-5031.00","name":"Police, Fire, or Ambulance Dispatcher"},{"en":"Receptionists are often the first employee of an organization to have phone or in person contact with a customer or client. They are responsible for making a good first impression for the organization—an impression that can affect the organization’s success. Their duties depend on where they work, such as in a hospital or a corporate office.","id":"ckc.US.base-6.03-6","soc":"43-4171.00","name":"Receptionist"},{"en":"Reservation and transportation ticket agents and travel clerks take and confirm passengers’ reservations for hotels and transportation. They also sell and issue tickets and answer questions about itineraries, rates, and package tours. Ticket agents who work at airports and railroads also check bags and issue boarding passes to passengers.","id":"ckc.US.base-6.03-7","soc":"43-4181.00","name":"Reservation or Transportation Ticket Agent"},{"en":"Court reporters create word-for-word transcriptions at trials, depositions, administrative hearings, and other legal proceedings. Some provide captioning for television and real-time translation for deaf or hard-of-hearing people at public events, in business meetings, and in classrooms.","id":"ckc.US.base-6.04-1","soc":"23-2091.00","name":"Court Reporter"},{"en":"These clerks manage the flow of information, work, and materials within or among offices in a business. They compile progress reports including any production problems. They set workers’ schedules, estimate costs, keep track of materials, and write special orders for new materials. They also enter data or distribute mail. Expediting clerks maintain contact with vendors to ensure that supplies and equipment are shipped on time.","id":"ckc.US.base-6.04-10","soc":"43-5061.00","name":"Production, Planning, or Expediting Clerks"},{"en":"These clerks keep track of and record outgoing and incoming shipments. They may scan barcodes with handheld devices or use radio frequency identification (RFID) scanners to keep track of inventory. They check to see whether shipment orders were correctly processed in their company’s computer system and compute freight costs.","id":"ckc.US.base-6.04-11","soc":"43-5071.00","name":"Shipping, Receiving, or Traffic Clerk"},{"en":"Stock clerks and order fillers receive, unpack, and track merchandise. Stock clerks move products from a warehouse to store shelves. They keep a record of items that enter or leave the stockroom and inspect for damaged goods. These clerks also use handheld RFID scanners to keep track of merchandise. Order fillers retrieve customer orders and prepare them to be shipped.","id":"ckc.US.base-6.04-12","soc":"43-5081.00","name":"Stock Clerk or Order Filler"},{"en":"Material and product inspecting clerks weigh, measure, check, sample, and keep records on materials, supplies, and equipment that enters a warehouse. They verify the quantity and quality of items they are assigned to examine, checking for defects and recording what they find. Some decide what to do about a defective product like scrapping it or sending it back to the factory to be repaired.","id":"ckc.US.base-6.04-13","soc":"43-5111.00","name":"Weigher, Measurer or Checker"},{"en":"Court clerks organize and maintain court records. They prepare the calendar of cases, also known as the docket, and inform attorneys and witnesses about their upcoming court appearances. Municipal clerks provide administrative support for town or city governments by maintaining government records. License clerks process applications for licenses and permits, administer tests, and collect application fees.","id":"ckc.US.base-6.04-2","soc":"43-4031.00","name":"Court, Municipal, or License Clerk"},{"en":"File clerks maintain electronic or paper records. They enter and retrieve data, organize records, and file documents. In organizations with electronic filing systems, they scan and upload documents.","id":"ckc.US.base-6.04-3","soc":"43-4071.00","name":"File Clerk"},{"en":"These assistants provide administrative support to human resources managers. They maintain personnel records on employees, including their addresses, employment history, and performance evaluations. They may post information about job openings and compile candidates’ résumés for review.","id":"ckc.US.base-6.04-4","soc":"43-4161.00","name":"Human Resources Assistant"},{"en":"These technicians organize and manage health information data by ensuring its quality, accuracy, accessibility, and security in both paper files and electronic systems. They use various classification systems to code and categorize patient information for insurance reimbursement purposes, for databases and registries, and to maintain patients’ medical and treatment histories.","id":"ckc.US.base-6.04-5","soc":"29-2071.00","name":"Medical Records and Health Information Technician"},{"en":"These healthcare documentation specialists listen to voice recordings that physicians and other healthcare workers make and convert them into written reports. They also may review and edit medical documents created using speech recognition technology. They interpret medical terminology and abbreviations in preparing patients’ medical histories, discharge summaries, and other documents.","id":"ckc.US.base-6.04-6","soc":"31-9094.00","name":"Medical Transcriptionist"},{"en":"These clerks receive orders from customers and process payments. For example, they may enter customer information, such as addresses and payment methods, into the order entry system. They also answer questions about prices and shipping.","id":"ckc.US.base-6.04-7","soc":"43-4151.00","name":"Order Clerk"},{"en":"Pharmacy technicians help pharmacists dispense prescription medication to customers or health professionals. They mainly work in retail pharmacies and hospitals.","id":"ckc.US.base-6.04-8","soc":"29-2052.00","name":"Pharmacy Technician"},{"en":"Carriers deliver mail to homes and businesses in cities, towns, and rural areas. Most travel established routes, delivering and collecting mail. They cover their routes by foot, vehicle, or a combination of both. Others, particularly in rural areas, sell postal products, such as stamps and money orders. They all answer customers’ questions about postal regulations and services.","id":"ckc.US.base-6.04-9","soc":"43-5052.00","name":"Postal Service Mail Carrier"},{"en":"These analysts advise various institutions—including governments, universities, and businesses—on how to organize their finances. They prepare annual reports, evaluate budget proposals, and analyze data to determine the costs and benefits of various programs, recommending funding levels. When government officials and top executives make decisions on an organization’s budget, they rely on the work of budget analysts.","id":"ckc.US.base-6.05-1","soc":"13-2031.00","name":"Budget Analyst"},{"en":"These secretaries provide high-level administrative support for an office and for top executives of an organization. They often handle more complex responsibilities, such as reviewing incoming documents, conducting research, and preparing reports. Some also supervise clerical staff.","id":"ckc.US.base-6.05-2","soc":"43-6011.00","name":"Executive Secretary or Administrative Assistant"},{"en":"These secretaries must know legal terminology and procedures. They prepare legal documents, such as summonses, complaints, motions, and subpoenas under the supervision of an attorney or a paralegal. They also review legal journals and help with legal research—for example, by verifying quotes and citations in legal briefs.","id":"ckc.US.base-6.05-3","soc":"43-6012.00","name":"Legal Secretary"},{"en":"These secretaries transcribe dictation and prepare reports or articles for physicians or medical scientists. They also take simple medical histories of patients, arrange for patients to be hospitalized, or process insurance payments. They must know medical terminology and codes, medical records, and hospital or laboratory procedures.","id":"ckc.US.base-6.05-4","soc":"43-6013.00","name":"Medical Secretary"},{"en":"Occupational health and safety technicians collect data on and analyze many types of work environments and work procedures. Technicians work with specialists in conducting tests and measuring hazards to help prevent harm to workers, property, the environment, and the general public.","id":"ckc.US.base-6.05-5","soc":"29-9012.00","name":"Occupational Health & Safety Technician"},{"en":"General office clerks perform a variety of clerical tasks, including answering telephones, typing documents, and filing records. Their duties depend on the type of office in which they work. For example, a clerk at a college or university may process application materials and answer questions from prospective students, while a clerk at a hospital may file and retrieve medical records.","id":"ckc.US.base-6.05-6","soc":"43-9061.00","name":"Office Clerk"},{"en":"Procurement clerks compile requests for materials, prepare purchase orders, keep track of purchases and supplies, and handle questions about orders. They respond to questions from customers and suppliers about the status of orders. Procurement clerks handle requests to change or cancel orders. They make sure that purchases arrive on schedule and that the items meet the purchaser’s specifications.","id":"ckc.US.base-6.05-7","soc":"43-3061.00","name":"Purchasing (Procurement) Clerk or Technician"},{"en":"Secretaries perform a variety of clerical and administrative duties necessary to run an efficient organization. They use computer software to create spreadsheets; manage databases; and prepare presentations, reports, and documents. They also may negotiate with vendors, buy supplies, and manage stockrooms or corporate libraries.","id":"ckc.US.base-6.05-8","soc":"43-6011.00","name":"Secretary"}]